nicolas-codemate/esp32-pixelcast/src/main.cpp
/**
 * ESP32-PixelCast
 *
 * Firmware for HUB75 LED matrix displays
 * Compatible with ESP32 Trinity and 64x64 panels
 *
 * @author nicolas-codemate
 * @license MIT
 * @version 0.1.0
 */

#include <Arduino.h>
#include "config.h"
#include "weather_icons.h"

// Display
#include <ESP32-HUB75-MatrixPanel-I2S-DMA.h>

// WiFi & Network
#include <WiFi.h>
#include <WiFiManager.h>
#include <ESPmDNS.h>

// Web Server
#include <ESPAsyncWebServer.h>
#include <AsyncTCP.h>
#include <AsyncJson.h>

// MQTT
#include <PubSubClient.h>

// JSON
#include <ArduinoJson.h>

// Filesystem
#include <LittleFS.h>

// PNG decoding
#include <PNGdec.h>

// Compact font for small text (IP address, status)
#include <Fonts/TomThumb.h>

// NTP
#include <time.h>

// HTTPS for LaMetric icon download
#include <WiFiClientSecure.h>
#include <HTTPClient.h>

// OTA updates
#include <ArduinoOTA.h>

// ============================================================================
// Application System - Structures
// ============================================================================

#define MAX_ZONES 4
#define MAX_TEXT_SEGMENTS 8

struct TextSegment {
    uint8_t offset;   // Visual char index where this color starts
    uint32_t color;   // 0xRRGGBB
};

struct AppZone {
    char text[32];
    char icon[32];
    char label[32];
    uint32_t textColor;
    TextSegment textSegments[MAX_TEXT_SEGMENTS];
    uint8_t textSegmentCount;
    TextSegment labelSegments[MAX_TEXT_SEGMENTS];
    uint8_t labelSegmentCount;
};

struct AppItem {
    char id[24];
    char text[64];
    char icon[32];
    char label[32];
    uint32_t textColor;
    uint16_t duration;          // Display duration in ms
    uint32_t lifetime;          // Expiration time (0 = permanent)
    uint32_t createdAt;         // Creation timestamp
    int8_t priority;            // -10 to 10 (higher = more important)
    uint8_t zoneCount;          // 0 or 1 = single layout, 2/3/4 = multi-zone
    bool active;
    bool isSystem;              // System apps cannot be deleted
    TextSegment textSegments[MAX_TEXT_SEGMENTS];
    uint8_t textSegmentCount;
    TextSegment labelSegments[MAX_TEXT_SEGMENTS];
    uint8_t labelSegmentCount;
    AppZone zones[3];           // zones 1-3 (zone 0 = main text/icon/textColor)
};

// ============================================================================
// Global Objects
// ============================================================================

// Display
MatrixPanel_I2S_DMA *dma_display = nullptr;

// Network
WiFiClient wifiClient;
WiFiManager wifiManager;

// Web Server
AsyncWebServer webServer(WEB_SERVER_PORT);

// MQTT
PubSubClient mqttClient(wifiClient);

// State
bool wifiConnected = false;
bool mqttConnected = false;
bool filesystemReady = false;
uint8_t currentBrightness = DEFAULT_BRIGHTNESS;
bool pendingReboot = false;
unsigned long rebootRequestTime = 0;

// Application Manager
AppItem apps[MAX_APPS];
uint8_t appCount = 0;
int8_t currentAppIndex = -1;
int8_t lastDisplayedAppIndex = -1;  // Track app switches for display clearing
unsigned long lastAppSwitch = 0;
bool appRotationEnabled = true;

// Scroll State
struct ScrollState {
    int16_t scrollOffset;
    unsigned long lastScrollTime;
    uint8_t scrollPhase;  // 0=pause_start, 1=scrolling, 2=pause_end
    bool needsScroll;
    int16_t textWidth;
    int16_t availableWidth;
};
ScrollState appScrollState;

// Icon Cache
struct CachedIcon {
    char name[32];
    uint16_t* pixels;  // RGB565 format
    uint8_t width;
    uint8_t height;
    bool valid;
    unsigned long lastUsed;
};
CachedIcon iconCache[MAX_ICON_CACHE];
PNG png;

// Failed icon download blacklist (prevents retry every frame)
#define MAX_FAILED_ICON_DOWNLOADS 8
#define FAILED_ICON_RETRY_DELAY 300000  // 5 minutes

struct FailedIconDownload {
    char name[32];
    unsigned long failedAt;
};

FailedIconDownload failedIconDownloads[MAX_FAILED_ICON_DOWNLOADS];

// Temporary buffer for PNG decode callback
uint16_t* pngDecodeTarget = nullptr;
uint8_t pngDecodeWidth = 0;

struct SleepSlot {
    uint8_t startHour;
    uint8_t startMinute;
    uint8_t endHour;
    uint8_t endMinute;
};

struct SleepDay {
    bool allDay;
    uint8_t slotCount;
    SleepSlot slots[MAX_SLOTS_PER_DAY];
};

struct SleepSchedule {
    bool enabled;
    char displayMode[8];
    SleepDay days[7];
    uint32_t sleepUntilEpoch;
};

enum SleepReason {
    SLEEP_REASON_NONE,
    SLEEP_REASON_SCHEDULE,
    SLEEP_REASON_OVERRIDE,
    SLEEP_REASON_NTP_NOT_SYNCED
};

// Settings from JSON
struct Settings {
    uint8_t brightness;
    bool autoRotate;
    uint16_t defaultDuration;
    char ntpServer[48];
    char tzPosix[64];
    bool clockEnabled;
    bool clockFormat24h;
    bool clockShowSeconds;
    uint32_t clockColor;
    bool dateEnabled;
    char dateFormat[16];
    uint32_t dateColor;
    bool mqttEnabled;
    char mqttServer[64];
    uint16_t mqttPort;
    char mqttUser[32];
    char mqttPassword[32];
    char mqttPrefix[32];
    SleepSchedule sleep;
} settings;
SleepReason lastSleepReason = SLEEP_REASON_NONE;

// Weather Data (populated by POST /api/weather)
#define MAX_FORECAST_DAYS 7    // Max storage (1 week)
#define FORECAST_COLUMNS  3    // Columns displayed simultaneously

struct WeatherData {
    char currentIcon[32];
    int16_t currentTemp;
    int16_t currentTempMin;
    int16_t currentTempMax;
    uint8_t currentHumidity;
    struct ForecastDay {
        char icon[32];
        int16_t tempMin;
        int16_t tempMax;
        char dayName[4];  // "LUN", "MAR", etc.
    } forecast[MAX_FORECAST_DAYS];
    uint8_t forecastCount;     // Number of forecast days received
    unsigned long lastUpdate;
    bool valid;
};
WeatherData weatherData;

// Tracker Data (populated by POST /api/tracker)
struct TrackerData {
    char name[16];            // Key: "btc", "eth", "aapl"
    char symbol[8];           // Display: "BTC", "ETH"
    char icon[32];            // Icon name (LittleFS)
    char currencySymbol[8];   // "USD", "EUR"
    float currentValue;       // Price/value
    float changePercent;      // +2.14 or -1.5
    uint16_t sparkline[MAX_SPARKLINE_POINTS];  // Scaled 0-65535
    uint8_t sparklineCount;
    uint32_t symbolColor;     // Header color (0xRRGGBB)
    uint32_t sparklineColor;  // Chart color
    char bottomText[32];      // Optional footer
    unsigned long lastUpdate;
    bool valid;
};
