nicolas-codemate/esp32-pixelcast/src/main.cpp
TrackerData trackers[MAX_TRACKERS];
uint8_t trackerCount = 0;

// Indicator Data
enum IndicatorMode : uint8_t {
    INDICATOR_OFF = 0,
    INDICATOR_SOLID = 1,
    INDICATOR_BLINK = 2,
    INDICATOR_FADE = 3
};

struct IndicatorData {
    IndicatorMode mode;
    uint32_t color;          // 0xRRGGBB
    uint16_t blinkInterval;  // ms (default INDICATOR_BLINK_INTERVAL)
    uint16_t fadePeriod;     // ms (default INDICATOR_FADE_PERIOD)
};
IndicatorData indicators[NUM_INDICATORS];

struct IndicatorAnimState {
    unsigned long lastToggle;
    bool blinkOn;
    unsigned long cycleStart;
};
IndicatorAnimState indicatorAnimState[NUM_INDICATORS];

// Notification Data
struct NotificationItem {
    char id[24];              // Unique ID ("notif_<millis>" or user-provided)
    char text[128];           // Notification text (longer than app's 64 chars)
    char icon[32];            // Icon filename
    uint32_t textColor;       // RGB color
    uint32_t backgroundColor; // RGB color for area outside card frame (0 = none)
    uint16_t duration;        // Display duration in ms (0 = hold mode)
    bool hold;                // Explicit hold flag (never auto-expires)
    bool urgent;              // Jumps to front of queue
    bool stack;               // Queue sequentially (true) vs replace current (false)
    bool active;              // Slot in use
    unsigned long displayedAt; // Timestamp when first displayed (0 = not yet shown)
};
NotificationItem notifications[MAX_NOTIFICATIONS];
uint8_t notificationCount = 0;
int8_t currentNotifIndex = -1;
int8_t savedAppIndex = -1;          // App to restore after notifications end
ScrollState notifScrollState;
unsigned long lastNotifScrollUpdate = 0;

// Timing
unsigned long lastMqttReconnectAttempt = 0;
unsigned long lastStatsPublish = 0;
unsigned long lastDisplayUpdate = 0;
unsigned long lastTimeUpdate = 0;
unsigned long lastScrollUpdate = 0;

// Forecast pagination
uint8_t forecastPage = 0;
unsigned long lastForecastPageSwitch = 0;

// Weather display cache (global so they can be reset on app switch)
int weatherLastDrawnMinute = -1;
unsigned long weatherLastUpdateDrawn = 0;

// Icon Upload State
File uploadFile;
String uploadIconName;
bool uploadValid = false;
size_t uploadSize = 0;

// Icons Web Interface HTML (stored in PROGMEM to save RAM)
const char ICONS_HTML[] PROGMEM = R"rawliteral(
<!DOCTYPE html>
<html>
<head>
    <title>PixelCast Icons</title>
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <style>
        body { font-family: sans-serif; max-width: 800px; margin: 0 auto; padding: 20px; background: #1a1a2e; color: #eee; }
        h1 { color: #00aaff; }
        h2 { color: #888; border-bottom: 1px solid #333; padding-bottom: 8px; }
        .grid { display: grid; grid-template-columns: repeat(auto-fill, minmax(100px, 1fr)); gap: 15px; }
        .icon { text-align: center; padding: 15px; background: #16213e; border-radius: 8px; position: relative; }
        .icon img { width: 48px; height: 48px; image-rendering: pixelated; background: #000; }
        .icon .name { margin-top: 8px; font-size: 12px; word-break: break-all; }
        .icon .size { font-size: 10px; color: #666; }
        .icon button { position: absolute; top: 5px; right: 5px; background: #ff4444; border: none; color: white; width: 20px; height: 20px; border-radius: 50%; cursor: pointer; font-size: 12px; }
        .icon button:hover { background: #ff6666; }
        input, button { padding: 10px 15px; margin: 5px; border: none; border-radius: 4px; }
        input[type="text"], input[type="number"] { background: #0f3460; color: #eee; width: 150px; }
        input[type="file"] { background: #0f3460; color: #eee; }
        button { background: #00aaff; color: white; cursor: pointer; }
        button:hover { background: #0088cc; }
        button:disabled { background: #444; cursor: not-allowed; }
        section { margin-bottom: 30px; padding: 20px; background: #16213e; border-radius: 8px; }
        a { color: #00aaff; }
        .storage { font-size: 12px; color: #888; margin-top: 10px; }
        .msg { padding: 10px; border-radius: 4px; margin: 10px 0; display: none; }
        .msg.success { background: #1a4d1a; color: #4caf50; display: block; }
        .msg.error { background: #4d1a1a; color: #f44336; display: block; }
        .loading { opacity: 0.5; pointer-events: none; }
    </style>
</head>
<body>
    <h1>PixelCast Icons</h1>
    <div id="msg" class="msg"></div>

    <section>
        <h2>Upload Icon</h2>
        <input type="text" id="name" placeholder="Icon name (no extension)">
        <input type="file" id="file" accept=".png,.gif">
        <button onclick="upload()" id="uploadBtn">Upload</button>
    </section>

    <section>
        <h2>Download from LaMetric</h2>
        <input type="number" id="lmId" placeholder="Icon ID (e.g. 2867)">
        <input type="text" id="lmName" placeholder="Save as (optional)">
        <button onclick="downloadLM()" id="lmBtn">Download</button>
        <a href="https://developer.lametric.com/icons" target="_blank">Browse LaMetric Icons</a>
    </section>

    <section>
        <h2>Icon Gallery</h2>
        <div id="gallery" class="grid"></div>
        <div id="storage" class="storage"></div>
    </section>

    <script>
        function showMsg(text, isError) {
            const el = document.getElementById('msg');
            el.textContent = text;
            el.className = 'msg ' + (isError ? 'error' : 'success');
            setTimeout(() => el.className = 'msg', 3000);
        }

        async function load() {
            try {
                const r = await fetch('/api/icons');
                const d = await r.json();
                document.getElementById('gallery').innerHTML = d.icons.length ? d.icons.map(i => `
                    <div class="icon">
                        <button onclick="del('${i.name}')" title="Delete">X</button>
                        <img src="/api/icons/${i.name}" onerror="this.src='data:image/gif;base64,R0lGODlhAQABAIAAAAAAAP///yH5BAEAAAAALAAAAAABAAEAAAIBRAA7'">
                        <div class="name">${i.name}</div>
                        <div class="size">${i.size}B</div>
                    </div>
                `).join('') : '<p style="color:#666">No icons uploaded yet</p>';
                document.getElementById('storage').innerHTML = `Storage: ${d.storage.used} / ${d.storage.total} bytes (${Math.round(d.storage.used/d.storage.total*100)}%)`;
            } catch(e) {
                showMsg('Failed to load icons: ' + e.message, true);
            }
        }

        async function upload() {
            const name = document.getElementById('name').value.trim();
            const file = document.getElementById('file').files[0];
            if (!name) { showMsg('Please enter icon name', true); return; }
            if (!file) { showMsg('Please select a file', true); return; }
            if (file.size > 8192) { showMsg('File too large (max 8KB)', true); return; }

            document.getElementById('uploadBtn').disabled = true;
            try {
                const fd = new FormData();
                fd.append('file', file);
                const r = await fetch('/api/icons?name=' + encodeURIComponent(name), {method: 'POST', body: fd});
                const d = await r.json();
                if (d.success) {
                    showMsg('Icon uploaded successfully', false);
                    document.getElementById('name').value = '';
                    document.getElementById('file').value = '';
                    load();
                } else {
                    showMsg(d.error || 'Upload failed', true);
                }
            } catch(e) {
                showMsg('Upload error: ' + e.message, true);
            }
            document.getElementById('uploadBtn').disabled = false;
        }

        async function downloadLM() {
            const id = parseInt(document.getElementById('lmId').value);
            const name = document.getElementById('lmName').value.trim() || String(id);
            if (!id) { showMsg('Please enter LaMetric icon ID', true); return; }

            document.getElementById('lmBtn').disabled = true;
            try {
                const r = await fetch('/api/icons/lametric', {
                    method: 'POST',
                    headers: {'Content-Type': 'application/json'},
                    body: JSON.stringify({id: id, name: name})
                });
                const d = await r.json();
                if (d.success) {
                    showMsg('Icon downloaded from LaMetric', false);
                    document.getElementById('lmId').value = '';
                    document.getElementById('lmName').value = '';
                    load();
                } else {
                    showMsg(d.error || 'Download failed', true);
                }
            } catch(e) {
                showMsg('Download error: ' + e.message, true);
            }
            document.getElementById('lmBtn').disabled = false;
        }

        async function del(name) {
            if (!confirm('Delete icon "' + name + '"?')) return;
            try {
                const r = await fetch('/api/icons?name=' + encodeURIComponent(name), {method: 'DELETE'});
                const d = await r.json();
                if (d.success) {
                    showMsg('Icon deleted', false);
                    load();
                } else {
                    showMsg(d.error || 'Delete failed', true);
                }
            } catch(e) {
                showMsg('Delete error: ' + e.message, true);
            }
        }

        load();
    </script>
</body>
</html>
)rawliteral";

// ============================================================================
// Function Prototypes
// ============================================================================

void setupDisplay();
void setupWiFi();
void setupMDNS();
void setupWebServer();
void setupMQTT();
void setupFilesystem();
void setupApps();

