nicolas-codemate/esp32-pixelcast/src/main.cpp
    delay(LOOP_DELAY);
}

// ============================================================================
// Display Functions
// ============================================================================

void setupDisplay() {
    HUB75_I2S_CFG mxconfig(
        PANEL_WIDTH,
        PANEL_HEIGHT,
        PANEL_CHAIN
    );

    // Trinity board pin configuration
    mxconfig.gpio.r1 = R1_PIN;
    mxconfig.gpio.g1 = G1_PIN;
    mxconfig.gpio.b1 = B1_PIN;
    mxconfig.gpio.r2 = R2_PIN;
    mxconfig.gpio.g2 = G2_PIN;
    mxconfig.gpio.b2 = B2_PIN;
    mxconfig.gpio.a = A_PIN;
    mxconfig.gpio.b = B_PIN;
    mxconfig.gpio.c = C_PIN;
    mxconfig.gpio.d = D_PIN;
    mxconfig.gpio.e = E_PIN;  // GPIO 18 on Trinity for 64x64 panels
    mxconfig.gpio.lat = LAT_PIN;
    mxconfig.gpio.oe = OE_PIN;
    mxconfig.gpio.clk = CLK_PIN;

    mxconfig.clkphase = false;
    mxconfig.driver = HUB75_I2S_CFG::SHIFTREG;

    #if DOUBLE_BUFFER
        mxconfig.double_buff = true;
    #endif

    dma_display = new MatrixPanel_I2S_DMA(mxconfig);

    if (!dma_display->begin()) {
        Serial.println("[ERROR] Display init failed!");
        while (true) { delay(1000); }
    }

    dma_display->setBrightness8(currentBrightness);
    dma_display->setTextWrap(false);  // Prevent ghost characters on text scroll
    dma_display->clearScreen();

    Serial.printf("[DISPLAY] Initialized %dx%d panel (E_PIN=%d)\n", PANEL_WIDTH, PANEL_HEIGHT, E_PIN);
}

void displayShowBoot() {
    dma_display->clearScreen();
    dma_display->setTextColor(dma_display->color565(0, 150, 255));
    dma_display->setTextSize(1);
    dma_display->setCursor(4, 24);
    dma_display->print("PixelCast");
    dma_display->setCursor(4, 36);
    dma_display->setTextColor(dma_display->color565(100, 100, 100));
    dma_display->print("v" VERSION_STRING);

    #if DOUBLE_BUFFER
        dma_display->flipDMABuffer();
    #endif
}

void displayShowIP() {
    dma_display->clearScreen();

    // "WiFi OK" in default font, centered
    dma_display->setFont(NULL);
    dma_display->setTextSize(1);
    dma_display->setTextColor(dma_display->color565(0, 255, 0));
    dma_display->setCursor(11, 12);
    dma_display->print("WiFi OK");

    // IP address in default font, split across 2 lines for readability
    // e.g. "192.168" on line 1, "1.100" on line 2
    String ip = WiFi.localIP().toString();
    dma_display->setTextColor(dma_display->color565(255, 255, 255));

    // Find the second dot to split the IP into 2 halves
    int firstDot = ip.indexOf('.');
    int secondDot = ip.indexOf('.', firstDot + 1);
    String line1 = ip.substring(0, secondDot);
    String line2 = ip.substring(secondDot + 1);

    // Line 1: first two octets (NULL font, 6px per char)
    int16_t line1Width = line1.length() * 6;
    int16_t line1X = (DISPLAY_WIDTH - line1Width) / 2;
    dma_display->setCursor(line1X, 28);
    dma_display->print(line1);

    // Line 2: last two octets
    int16_t line2Width = line2.length() * 6;
    int16_t line2X = (DISPLAY_WIDTH - line2Width) / 2;
    dma_display->setCursor(line2X, 40);
    dma_display->print(line2);

    #if DOUBLE_BUFFER
        dma_display->flipDMABuffer();
    #endif

    delay(3000);
}

void displayShowTime() {
    dma_display->clearScreen();

    // Get time
    int hours = currentLocalHour();
    int minutes = currentLocalMinute();
    int seconds = currentLocalSecond();

    // Apply 12h format if configured
    if (!settings.clockFormat24h && hours > 12) {
        hours -= 12;
    }

    // Format time string
    char timeStr[9];
    if (settings.clockShowSeconds) {
        snprintf(timeStr, sizeof(timeStr), "%02d:%02d:%02d", hours, minutes, seconds);
    } else {
        snprintf(timeStr, sizeof(timeStr), "%02d:%02d", hours, minutes);
    }

    // Extract RGB from color
    uint8_t r = (settings.clockColor >> 16) & 0xFF;
    uint8_t g = (settings.clockColor >> 8) & 0xFF;
    uint8_t b = settings.clockColor & 0xFF;

    // Draw time centered
    dma_display->setTextColor(dma_display->color565(r, g, b));
    dma_display->setTextSize(1);

    // Center text based on format
    int textWidth = settings.clockShowSeconds ? 48 : 30;
    int xPos = (DISPLAY_WIDTH - textWidth) / 2;
    dma_display->setCursor(xPos, 28);
    dma_display->print(timeStr);

    drawIndicators();

    #if DOUBLE_BUFFER
        dma_display->flipDMABuffer();
    #endif
}

void displayShowDate() {
    dma_display->clearScreen();

    // Get date from NTP epoch
    unsigned long epochTime = currentLocalEpoch();
    struct tm* timeinfo = gmtime((time_t*)&epochTime);

    uint8_t day = timeinfo->tm_mday;
    uint8_t month = timeinfo->tm_mon + 1;
    uint16_t year = timeinfo->tm_year + 1900;

    // Format date string based on settings
    char dateStr[16];
    if (strcmp(settings.dateFormat, "MM/DD/YYYY") == 0) {
        snprintf(dateStr, sizeof(dateStr), "%02u/%02u/%04u", month, day, year);
    } else if (strcmp(settings.dateFormat, "YYYY-MM-DD") == 0) {
        snprintf(dateStr, sizeof(dateStr), "%04u-%02u-%02u", year, month, day);
    } else {
        // Default: DD/MM/YYYY
        snprintf(dateStr, sizeof(dateStr), "%02u/%02u/%04u", day, month, year);
    }

    // Extract RGB from color
    uint8_t r = (settings.dateColor >> 16) & 0xFF;
    uint8_t g = (settings.dateColor >> 8) & 0xFF;
    uint8_t b = settings.dateColor & 0xFF;

    // Draw date centered
    dma_display->setTextColor(dma_display->color565(r, g, b));
    dma_display->setTextSize(1);

    int textWidth = 60;
    int xPos = (DISPLAY_WIDTH - textWidth) / 2;
    dma_display->setCursor(xPos, 28);
    dma_display->print(dateStr);

    drawIndicators();

    #if DOUBLE_BUFFER
        dma_display->flipDMABuffer();
    #endif
}

// Draw icon at explicit scale (1 = native, 2 = upscale x2)
void drawIconAtScale(CachedIcon* icon, int16_t x, int16_t y, uint8_t scale) {
    if (!icon || !icon->valid || !icon->pixels) return;

    for (uint8_t py = 0; py < icon->height; py++) {
        for (uint8_t px = 0; px < icon->width; px++) {
            uint16_t pixel = icon->pixels[py * icon->width + px];
            if (pixel != 0) {
                if (scale == 2) {
                    int16_t dx = x + px * 2;
                    int16_t dy = y + py * 2;
                    dma_display->drawPixel(dx, dy, pixel);
                    dma_display->drawPixel(dx + 1, dy, pixel);
                    dma_display->drawPixel(dx, dy + 1, pixel);
                    dma_display->drawPixel(dx + 1, dy + 1, pixel);
                } else {
                    dma_display->drawPixel(x + px, y + py, pixel);
                }
            }
        }
    }
}

// Draw a small water drop icon (5px tall)
void drawDropIcon(int16_t x, int16_t y, uint16_t color) {
    //   .X.
    //   .X.
    //   XXX
    //   XXX
    //   .X.
    dma_display->drawPixel(x + 1, y,     color);
    dma_display->drawPixel(x + 1, y + 1, color);
    dma_display->drawPixel(x,     y + 2, color);
    dma_display->drawPixel(x + 1, y + 2, color);
    dma_display->drawPixel(x + 2, y + 2, color);
    dma_display->drawPixel(x,     y + 3, color);
    dma_display->drawPixel(x + 1, y + 3, color);
    dma_display->drawPixel(x + 2, y + 3, color);
    dma_display->drawPixel(x + 1, y + 4, color);
}

// Draw a thin horizontal separator line
void drawSeparatorLine(int16_t y, uint16_t color) {
    for (int16_t x = 4; x < DISPLAY_WIDTH - 4; x++) {
        dma_display->drawPixel(x, y, color);
    }
}

// ============================================================================
// Tracker Functions
// ============================================================================

TrackerData* trackerFind(const char* name) {
    for (uint8_t i = 0; i < MAX_TRACKERS; i++) {
        if (trackers[i].valid && strcmp(trackers[i].name, name) == 0) {
            return &trackers[i];
        }
    }
    return nullptr;
}

TrackerData* trackerAllocate(const char* name) {
    // Check if already exists
    TrackerData* existing = trackerFind(name);
    if (existing) return existing;

    // Find first free slot
    for (uint8_t i = 0; i < MAX_TRACKERS; i++) {
        if (!trackers[i].valid) {
            memset(&trackers[i], 0, sizeof(TrackerData));
            strlcpy(trackers[i].name, name, sizeof(trackers[i].name));
            trackers[i].symbolColor = 0xFFFFFF;    // Default white
            trackers[i].sparklineColor = 0x00D4FF;  // Default cyan
            trackers[i].valid = true;
            trackerCount++;
            return &trackers[i];
        }
    }
    return nullptr;
}

bool trackerRemove(const char* name) {
    TrackerData* tracker = trackerFind(name);
    if (!tracker) return false;

    tracker->valid = false;
    trackerCount--;

