nicolas-codemate/esp32-pixelcast/src/main.cpp
        dma_display->setFont(&TomThumb);
        dma_display->setTextColor(coldBlue);
        dma_display->setCursor(todayX, 8);
        dma_display->print(todayMinStr);
        dma_display->setTextColor(gray);
        dma_display->setCursor(todayX + todayMinW, 8);
        dma_display->print("/");
        dma_display->setTextColor(warmRed);
        dma_display->setCursor(todayX + todayMinW + todaySlashW, 8);
        dma_display->print(todayMaxStr);

        // ---- Separator (y=10) ----
        dma_display->fillRect(0, 10, DISPLAY_WIDTH, 1, black);
        drawSeparatorLine(10, dimGray);

        // ---- Date (y=21-30) ----
        dma_display->fillRect(0, 21, DISPLAY_WIDTH, 10, black);
        unsigned long epochTime = currentLocalEpoch();
        struct tm* timeinfo = gmtime((time_t*)&epochTime);

        static const char* dayNamesFr[] = {"DIM", "LUN", "MAR", "MER", "JEU", "VEN", "SAM"};
        static const char* monthNamesFr[] = {"JAN", "FEV", "MAR", "AVR", "MAI", "JUN",
                                             "JUL", "AOU", "SEP", "OCT", "NOV", "DEC"};

        char dateStr[16];
        snprintf(dateStr, sizeof(dateStr), "%s %02d %s",
                 dayNamesFr[timeinfo->tm_wday],
                 timeinfo->tm_mday,
                 monthNamesFr[timeinfo->tm_mon]);

        dma_display->setFont(NULL);
        dma_display->setTextSize(1);
        dma_display->setTextColor(gray);

        int16_t dateWidth = strlen(dateStr) * 6;
        int16_t dateX = (DISPLAY_WIDTH - dateWidth) / 2;
        dma_display->setCursor(dateX, 22);
        dma_display->print(dateStr);

        // ---- Separator (y=31) ----
        drawSeparatorLine(31, dimGray);

        weatherLastDrawnMinute = minutes;
        weatherLastUpdateDrawn = weatherData.lastUpdate;
    }

    // ---- Forecast (y=33-63) - redrawn on full redraw or page change ----
    if (needsForecastRedraw) {
        dma_display->fillRect(0, 32, DISPLAY_WIDTH, 32, black);

        // Compute which forecast days to display on the current page
        uint8_t pageStart = forecastPage * FORECAST_COLUMNS;
        uint8_t displayCount = min((uint8_t)FORECAST_COLUMNS,
            (uint8_t)(weatherData.forecastCount - pageStart));

        for (int col = 0; col < displayCount; col++) {
            int forecastIndex = pageStart + col;

            // Dynamic centering based on number of columns on this page
            int16_t colCenter;
            if (displayCount == 1) {
                colCenter = 32;
            } else if (displayCount == 2) {
                colCenter = 16 + col * 32;
            } else {
                colCenter = 11 + col * 21;
            }

            // Day name (TomThumb baseline=39, glyphs y=34-38)
            dma_display->setFont(&TomThumb);
            dma_display->setTextColor(coral);
            int16_t dayNameWidth = strlen(weatherData.forecast[forecastIndex].dayName) * 4;
            dma_display->setCursor(colCenter - dayNameWidth / 2, 39);
            dma_display->print(weatherData.forecast[forecastIndex].dayName);

            // Forecast icon (8x8 native, y=41-48)
            const uint16_t* builtinForecastIcon = getBuiltinWeatherIcon(weatherData.forecast[forecastIndex].icon);
            if (builtinForecastIcon) {
                drawProgmemIcon(dma_display, builtinForecastIcon, colCenter - 4, 41, 1);
            } else {
                CachedIcon* forecastIcon = getIcon(weatherData.forecast[forecastIndex].icon);
                if (forecastIcon && forecastIcon->valid) {
                    drawIconAtScale(forecastIcon, colCenter - 4, 41, 1);
                }
            }

            // Min temp in blue (TomThumb baseline=56, glyphs y=51-55)
            char minStr[8];
            snprintf(minStr, sizeof(minStr), "%d", weatherData.forecast[forecastIndex].tempMin);
            dma_display->setFont(&TomThumb);
            dma_display->setTextColor(coldBlue);
            int16_t minWidth = strlen(minStr) * 4;
            dma_display->setCursor(colCenter - minWidth / 2, 56);
            dma_display->print(minStr);

            // Max temp in red (TomThumb baseline=63, glyphs y=58-62)
            char maxStr[8];
            snprintf(maxStr, sizeof(maxStr), "%d", weatherData.forecast[forecastIndex].tempMax);
            dma_display->setTextColor(warmRed);
            int16_t maxWidth = strlen(maxStr) * 4;
            dma_display->setCursor(colCenter - maxWidth / 2, 63);
            dma_display->print(maxStr);
        }

        // Page indicator squares (vertical, right edge, just below second separator)
        if (forecastPageCount > 1) {
            uint16_t activeDot = dma_display->color565(120, 60, 200);  // Dark violet
            int squareSize = 2;
            int gap = 1;
            int step = squareSize + gap;  // 3px per indicator
            int dotX = 61;               // 2px margin from right edge (x=63)
            int dotStartY = 33;          // Just below separator at y=31
            for (int d = 0; d < forecastPageCount; d++) {
                uint16_t dotColor = (d == forecastPage) ? activeDot : dimGray;
                dma_display->fillRect(dotX, dotStartY + d * step, squareSize, squareSize, dotColor);
            }
        }
    }

    // ---- Clock (y=13-20) - redrawn every second ----
    // Clear only the clock region (y=11 to y=20) to avoid full-screen flicker
    dma_display->fillRect(0, 11, DISPLAY_WIDTH, 10, black);

    dma_display->setTextColor(mintGreen);

    // HH:MM in NULL font (5 chars * 6px = 30px)
    char hmStr[6];
    snprintf(hmStr, sizeof(hmStr), "%02d:%02d", hours, minutes);
    dma_display->setFont(NULL);
    dma_display->setTextSize(1);

    int16_t hmX = (DISPLAY_WIDTH - 30) / 2 - 6;  // Shift left for seconds
    dma_display->setCursor(hmX, 13);
    dma_display->print(hmStr);

    // Seconds in TomThumb (baseline=20, bottom-aligned with NULL font y=13+6=19)
    dma_display->setFont(&TomThumb);
    char secStr[4];
    snprintf(secStr, sizeof(secStr), ":%02d", seconds);
    dma_display->setCursor(hmX + 31, 20);
    dma_display->print(secStr);

    // Reset font
    dma_display->setFont(NULL);

