nicolas-codemate/esp32-pixelcast/src/main.cpp
    drawIndicators();

    #if DOUBLE_BUFFER
        dma_display->flipDMABuffer();
    #endif
}

void displayShowApp(AppItem* app) {
    if (!app) return;

    // Detect app switch and clear screen to prevent ghosting
    int8_t appIndex = appFind(app->id);
    if (appIndex != lastDisplayedAppIndex) {
        dma_display->clearScreen();
        #if DOUBLE_BUFFER
            dma_display->flipDMABuffer();
            dma_display->clearScreen();
        #endif
        lastDisplayedAppIndex = appIndex;
        // Reset weather display cache to force full redraw
        weatherLastDrawnMinute = -1;
        weatherLastUpdateDrawn = 0;
        // Reset forecast pagination to first page
        forecastPage = 0;
        lastForecastPageSwitch = millis();
    }

    // Handle system apps
    if (strcmp(app->id, "clock") == 0) {
        displayShowTime();
        return;
    }

    if (strcmp(app->id, "date") == 0) {
        displayShowDate();
        return;
    }

    if (strcmp(app->id, "weatherclock") == 0) {
        displayShowWeatherClock(app->duration);
        return;
    }

    // Tracker layout apps (ID starts with "tracker_")
    if (strncmp(app->id, TRACKER_ID_PREFIX, strlen(TRACKER_ID_PREFIX)) == 0) {
        const char* trackerName = app->id + strlen(TRACKER_ID_PREFIX);
        TrackerData* tracker = trackerFind(trackerName);
        if (tracker && tracker->valid) {
            displayShowTracker(tracker);
            return;
        }
        // Fallback to default custom app layout if no data
    }

    // Multi-zone layout apps
    if (app->zoneCount >= 2) {
        displayShowMultiZone(app);
        return;
    }

    // Custom apps (single-zone)
    dma_display->clearScreen();

    // Layout calculation - VERTICAL layout for 64x64 panel
    // +----------64px-----------+
    // |      Icon (8-16px)      |  <- centered, top
    // |                         |
    // |         Text            |  <- centered, below icon
    // |      (scrollable)       |
    // +-------------------------+

    int16_t textAreaX = 2;
    int16_t textAreaWidth = DISPLAY_WIDTH - 4;  // 2px margin each side
    int16_t textYPos = 28;  // Default Y position for text

    // Try to load icon if specified
    CachedIcon* icon = nullptr;
    if (strlen(app->icon) > 0) {
        icon = getIcon(app->icon);
    }

    // Adjust layout if icon is present - VERTICAL layout
    if (icon && icon->valid) {
        // Calculate displayed size (upscale x2 for 8x8 icons)
        uint8_t scale = (icon->width <= 8 && icon->height <= 8) ? 2 : 1;
        uint8_t displayWidth = icon->width * scale;
        uint8_t displayHeight = icon->height * scale;

        // Draw icon centered horizontally at top
        int16_t iconX = (DISPLAY_WIDTH - displayWidth) / 2;
        int16_t iconY = 2;  // 2px from top
        drawIcon(icon, iconX, iconY);

        // Text starts below icon with gap
        textYPos = iconY + displayHeight + 6;  // 6px gap below icon
    }

    dma_display->setTextSize(1);

    // Calculate text width and check if scrolling needed
    int16_t textWidth = calculateTextWidth(app->text);
    bool needsScroll = textWidth > textAreaWidth;

    // Update scroll state if this is new text or scroll requirements changed
    if (appScrollState.textWidth != textWidth || appScrollState.availableWidth != textAreaWidth) {
        appScrollState.textWidth = textWidth;
        appScrollState.availableWidth = textAreaWidth;
        appScrollState.needsScroll = needsScroll;
        if (!needsScroll) {
            appScrollState.scrollOffset = 0;
            appScrollState.scrollPhase = 0;
        }
    }

    // Calculate x position with scroll offset
    int16_t xPos = textAreaX;
    if (needsScroll) {
        xPos = textAreaX - appScrollState.scrollOffset;
    }

    // Draw text with segment-aware coloring
    printTextWithSegments(app->text, xPos, textYPos, app->textColor,
                          app->textSegments, app->textSegmentCount);

    // Draw label below text if present (TomThumb font, dimmed color)
    if (app->label[0] != '\0') {
        int16_t labelWidth = strlen(app->label) * 4;
        int16_t labelX = (DISPLAY_WIDTH - labelWidth) / 2;
        if (labelX < 2) labelX = 2;
        int16_t labelY = textYPos + 12;
        printLabelWithSegments(app->label, labelX, labelY, app->textColor,
                               app->labelSegments, app->labelSegmentCount, true);
    }

    drawIndicators();

    #if DOUBLE_BUFFER
        dma_display->flipDMABuffer();
    #endif
}

// ============================================================================
// Multi-Zone Display Rendering
// ============================================================================

// Render a single zone within its bounding box
void displayShowZone(AppZone* zone, int16_t x, int16_t y, int16_t w, int16_t h) {
    if (!zone) return;

    dma_display->setTextSize(1);

    // Try to load icon
    CachedIcon* icon = nullptr;
    if (strlen(zone->icon) > 0) {
        icon = getIcon(zone->icon);
    }

    bool isFullWidth = (w >= 48);

    bool hasLabel = (zone->label[0] != '\0');

    // Layout constants for label positioning
    // NULL font: setCursor = top of glyph, 7px tall -> occupies textY to textY+6
    // TomThumb: setCursor = baseline, ~5px above -> occupies labelY-4 to labelY
    // Gap of 2px between text bottom and label top: labelY - 4 = textY + 6 + 2 -> labelY = textY + 12

    if (isFullWidth) {
        // Full-width zone (64x31): icon left, text+label right
        int16_t textX = x + 2;

        // With label: spread text (upper) and label (lower) across zone height
        // Without label: center text vertically
        // h=31 -> text at y+4 (top=y+4..y+10), label baseline at y+23 (top=y+19..y+23)
        int16_t textY = hasLabel ? y + 4 : y + (h / 2) - 3;

        if (icon && icon->valid) {
            // Icon at left, vertically centered in zone
            uint8_t scale = (icon->width <= 8 && icon->height <= 8) ? 2 : 1;
            uint8_t displayWidth = icon->width * scale;
            uint8_t displayHeight = icon->height * scale;
            int16_t iconX = x + 2;
            int16_t iconY = y + (h - displayHeight) / 2;
            drawIconAtScale(icon, iconX, iconY, scale);

            // Text starts after icon
            textX = iconX + displayWidth + 3;
        }

