nicolas-codemate/esp32-pixelcast/src/main.cpp
        // Truncate text to fit available width
        int16_t availableWidth = (x + w) - textX;
        int16_t maxChars = availableWidth / 6;  // 6px per char (5x7 font + 1px spacing)
        char truncatedText[32];
        strlcpy(truncatedText, zone->text, sizeof(truncatedText));
        if ((int16_t)strlen(truncatedText) > maxChars && maxChars > 0) {
            truncatedText[maxChars] = '\0';
        }

        printTextWithSegments(truncatedText, textX, textY, zone->textColor,
                              zone->textSegments, zone->textSegmentCount);

        // Draw label in lower portion of zone (TomThumb, dimmed)
        if (hasLabel) {
            int16_t labelY = y + h - 6;  // Near bottom of zone
            printLabelWithSegments(zone->label, textX, labelY, zone->textColor,
                                   zone->labelSegments, zone->labelSegmentCount, true);
        }
    } else {
        // Half-width zone (31x31): icon top-left, text beside icon, label at bottom
        bool hasIcon = (icon && icon->valid);

        int16_t textX = x;
        int16_t textY = hasLabel ? y + 3 : y + (h / 2) - 3;

        if (hasIcon) {
            // Icon at top-left, tight margins, native size (no upscale)
            int16_t iconX = x;
            int16_t iconY = y + 2;
            drawIconAtScale(icon, iconX, iconY, 1);

            // Text starts after icon with 1px gap
            textX = iconX + icon->width + 1;
        }

        // Check if text fits in default font (6px/char), fallback to TomThumb (4px/char)
        int16_t availableWidth = (x + w) - textX;
        int16_t textLen = (int16_t)strlen(zone->text);
        bool useCompactText = (textLen * 6 > availableWidth);
        int16_t charWidth = useCompactText ? 4 : 6;

        int16_t maxChars = availableWidth / charWidth;
        char truncatedText[32];
        strlcpy(truncatedText, zone->text, sizeof(truncatedText));
        if (textLen > maxChars && maxChars > 0) {
            truncatedText[maxChars] = '\0';
        }

        if (useCompactText) {
            // TomThumb: baseline positioning, adjust Y (+5px from top for baseline)
            int16_t compactY = hasLabel ? y + 8 : y + (h / 2) + 2;
            printLabelWithSegments(truncatedText, textX, compactY, zone->textColor,
                                   zone->textSegments, zone->textSegmentCount, false);
        } else {
            // Default font
            printTextWithSegments(truncatedText, textX, textY, zone->textColor,
                                  zone->textSegments, zone->textSegmentCount);
        }

        // Draw label at bottom of zone with good margin
        if (hasLabel) {
            int16_t labelWidth = strlen(zone->label) * 4;
            int16_t labelX = x + (w - labelWidth) / 2;
            if (labelX < x) labelX = x;
            int16_t labelY = y + h - 6;
            printLabelWithSegments(zone->label, labelX, labelY, zone->textColor,
                                   zone->labelSegments, zone->labelSegmentCount, true);
        }
    }
}

// Render multi-zone layout for an app
void displayShowMultiZone(AppItem* app) {
    if (!app || app->zoneCount < 2) return;

    dma_display->clearScreen();

    // Build array of all zones (zone 0 from main app fields, zones 1-3 from zones[])
    AppZone zone0;
    strlcpy(zone0.text, app->text, sizeof(zone0.text));
    strlcpy(zone0.icon, app->icon, sizeof(zone0.icon));
    strlcpy(zone0.label, app->label, sizeof(zone0.label));
    zone0.textColor = app->textColor;
    memcpy(zone0.textSegments, app->textSegments, sizeof(app->textSegments));
    zone0.textSegmentCount = app->textSegmentCount;
    memcpy(zone0.labelSegments, app->labelSegments, sizeof(app->labelSegments));
    zone0.labelSegmentCount = app->labelSegmentCount;

    AppZone* allZones[MAX_ZONES] = { &zone0, nullptr, nullptr, nullptr };
    for (uint8_t i = 1; i < app->zoneCount && i < MAX_ZONES; i++) {
        allZones[i] = &app->zones[i - 1];
    }

    // Separator line color (dark gray)
    uint16_t separatorColor = dma_display->color565(40, 40, 40);

    switch (app->zoneCount) {
        case 2: {
            // Two horizontal rows: zone0 top (64x31), zone1 bottom (64x31)
            // Separator at y=31
            dma_display->drawFastHLine(0, 31, 64, separatorColor);

            displayShowZone(allZones[0], 0, 0, 64, 31);
            displayShowZone(allZones[1], 0, 33, 64, 31);
            break;
        }
        case 3: {
            // Top row full-width (zone0, 64x31), bottom row split (zone1 + zone2, 31x31 each)
            // Horizontal separator at y=31
            dma_display->drawFastHLine(0, 31, 64, separatorColor);
            // Vertical separator in bottom half at x=31
            dma_display->drawFastVLine(31, 33, 31, separatorColor);

            displayShowZone(allZones[0], 0, 0, 64, 31);
            displayShowZone(allZones[1], 0, 33, 31, 31);
            displayShowZone(allZones[2], 33, 33, 31, 31);
            break;
        }
        case 4: {
            // Four quadrants (31x31 each)
            // Horizontal separator at y=31
            dma_display->drawFastHLine(0, 31, 64, separatorColor);
            // Vertical separator at x=31
            dma_display->drawFastVLine(31, 0, 64, separatorColor);

            displayShowZone(allZones[0], 0, 0, 31, 31);
            displayShowZone(allZones[1], 33, 0, 31, 31);
            displayShowZone(allZones[2], 0, 33, 31, 31);
            displayShowZone(allZones[3], 33, 33, 31, 31);
            break;
        }
    }

    drawIndicators();

    #if DOUBLE_BUFFER
        dma_display->flipDMABuffer();
    #endif
}

void displayClear() {
    dma_display->clearScreen();
    #if DOUBLE_BUFFER
        dma_display->flipDMABuffer();
    #endif
}

void displaySetBrightness(uint8_t brightness) {
    currentBrightness = constrain(brightness, MIN_BRIGHTNESS, MAX_BRIGHTNESS);
    dma_display->setBrightness8(currentBrightness);
    Serial.printf("[DISPLAY] Brightness set to %d\n", currentBrightness);
}

int16_t calculateTextWidth(const char* text) {
    // Default 5x7 font with 1px spacing = 6 pixels per character
    return strlen(text) * 6;
}

bool textNeedsScroll(const char* text, int16_t availableWidth) {
    return calculateTextWidth(text) > availableWidth;
}

void resetScrollState() {
    appScrollState.scrollOffset = 0;
    appScrollState.lastScrollTime = millis();
    appScrollState.scrollPhase = 0;  // Start with pause
    appScrollState.needsScroll = false;
    appScrollState.textWidth = 0;
    appScrollState.availableWidth = DISPLAY_WIDTH - 4;  // 2px margin each side
}

