nicolas-codemate/esp32-pixelcast/src/main.cpp
void resetNotifScrollState() {
    notifScrollState.scrollOffset = 0;
    notifScrollState.lastScrollTime = millis();
    notifScrollState.scrollPhase = 0;
    notifScrollState.needsScroll = false;
    notifScrollState.textWidth = 0;
    notifScrollState.availableWidth = DISPLAY_WIDTH - 4;  // Full width minus 2px padding each side
}

// ============================================================================
// Notification Display
// ============================================================================

void displayShowNotification(NotificationItem* notif) {
    if (!notif || !notif->active) return;

    // Mark display timestamp on first render
    if (notif->displayedAt == 0) {
        notif->displayedAt = millis();
    }

    // Layout: horizontal separators with background color margins
    // [bg margin 4px] [separator line] [content: icon + text] [separator line] [bg margin 4px]
    const int16_t marginHeight = 6;
    const int16_t separatorTopY = marginHeight;                            // y=4
    const int16_t separatorBottomY = DISPLAY_HEIGHT - marginHeight - 1;    // y=59
    const int16_t contentY = separatorTopY + 2;                            // y=6
    const int16_t contentH = separatorBottomY - contentY - 1;             // 52
    const int16_t textPadding = 2;                                         // Horizontal text padding
    const int16_t textAreaWidth = DISPLAY_WIDTH - textPadding * 2;         // 60

    // Colors
    uint8_t tr = (notif->textColor >> 16) & 0xFF;
    uint8_t tg = (notif->textColor >> 8) & 0xFF;
    uint8_t tb = notif->textColor & 0xFF;
    uint16_t lineColor = dma_display->color565(tr, tg, tb);
    uint16_t black = dma_display->color565(0, 0, 0);

    uint16_t bgFill = black;
    if (notif->backgroundColor != 0) {
        uint8_t br = (notif->backgroundColor >> 16) & 0xFF;
        uint8_t bg = (notif->backgroundColor >> 8) & 0xFF;
        uint8_t bb = notif->backgroundColor & 0xFF;
        bgFill = dma_display->color565(br, bg, bb);
    }

    // === Build frame (no clearScreen to avoid DMA flicker) ===

    // 1. Background color margins (top and bottom strips)
    dma_display->fillRect(0, 0, DISPLAY_WIDTH, marginHeight, bgFill);
    dma_display->fillRect(0, DISPLAY_HEIGHT - marginHeight, DISPLAY_WIDTH, marginHeight, bgFill);

    // 2. Content area (black)
    dma_display->fillRect(0, marginHeight, DISPLAY_WIDTH, DISPLAY_HEIGHT - marginHeight * 2, black);

    // 3. Separator lines
    uint16_t separatorColor = (bgFill != black) ? bgFill : lineColor;
    dma_display->drawFastHLine(0, separatorTopY, DISPLAY_WIDTH, separatorColor);
    dma_display->drawFastHLine(0, separatorBottomY, DISPLAY_WIDTH, separatorColor);

    // 4. Load icon
    CachedIcon* icon = nullptr;
    uint8_t iconDisplayW = 0;
    uint8_t iconDisplayH = 0;
    if (strlen(notif->icon) > 0) {
        icon = getIcon(notif->icon);
        if (icon && icon->valid) {
            uint8_t scale = (icon->width <= 8 && icon->height <= 8) ? 2 : 1;
            iconDisplayW = icon->width * scale;
            iconDisplayH = icon->height * scale;
        } else {
            icon = nullptr;
        }
    }

    // 5. Vertical centering of content (icon + text)
    const int16_t textHeight = 7;
    const int16_t iconTextGap = 4;
    int16_t totalContentH = textHeight;
    if (icon) {
        totalContentH = iconDisplayH + iconTextGap + textHeight;
    }
    int16_t contentStartY = contentY + (contentH - totalContentH) / 2;

    // 6. Draw icon centered horizontally
    int16_t textYPos;
    if (icon) {
        int16_t iconX = (DISPLAY_WIDTH - iconDisplayW) / 2;
        drawIcon(icon, iconX, contentStartY);
        textYPos = contentStartY + iconDisplayH + iconTextGap;
    } else {
        textYPos = contentStartY;
    }

    // 7. Draw text (full width, scrolls off-screen naturally - no clipping needed)
    dma_display->setTextColor(lineColor);
    dma_display->setTextSize(1);

    int16_t textWidth = calculateTextWidth(notif->text);
    bool needsScroll = textWidth > textAreaWidth;

    if (notifScrollState.textWidth != textWidth || notifScrollState.availableWidth != textAreaWidth) {
        notifScrollState.textWidth = textWidth;
        notifScrollState.availableWidth = textAreaWidth;
        notifScrollState.needsScroll = needsScroll;
        if (!needsScroll) {
            notifScrollState.scrollOffset = 0;
            notifScrollState.scrollPhase = 0;
        }
    }

    int16_t xPos;
    if (!needsScroll) {
        xPos = textPadding + (textAreaWidth - textWidth) / 2;
    } else {
        xPos = textPadding - notifScrollState.scrollOffset;
    }

    printTextWithSpecialChars(notif->text, xPos, textYPos);

    drawIndicators();

    #if DOUBLE_BUFFER
        dma_display->flipDMABuffer();
    #endif
}

// ============================================================================
// Indicator Functions
// ============================================================================

void indicatorInit() {
    memset(indicators, 0, sizeof(indicators));
    memset(indicatorAnimState, 0, sizeof(indicatorAnimState));

    // Default colors: red, green, blue
    indicators[0].color = 0xFF0000;
    indicators[1].color = 0x00FF00;
    indicators[2].color = 0x0000FF;

    for (uint8_t i = 0; i < NUM_INDICATORS; i++) {
        indicators[i].blinkInterval = INDICATOR_BLINK_INTERVAL;
        indicators[i].fadePeriod = INDICATOR_FADE_PERIOD;
    }
}

void indicatorSet(uint8_t index, IndicatorMode mode, uint32_t color,
                  uint16_t blinkInterval, uint16_t fadePeriod) {
    if (index >= NUM_INDICATORS) return;

    indicators[index].mode = mode;
    indicators[index].color = color;
    indicators[index].blinkInterval = blinkInterval > 0 ? blinkInterval : INDICATOR_BLINK_INTERVAL;
    indicators[index].fadePeriod = fadePeriod > 0 ? fadePeriod : INDICATOR_FADE_PERIOD;

    // Reset animation state
    indicatorAnimState[index].lastToggle = millis();
    indicatorAnimState[index].blinkOn = true;
    indicatorAnimState[index].cycleStart = millis();
}

void indicatorOff(uint8_t index) {
    if (index >= NUM_INDICATORS) return;
    indicators[index].mode = INDICATOR_OFF;
}

