nicolas-codemate/esp32-pixelcast/src/main.cpp
        // Handle Latin-1 degree symbol (direct byte 0xB0)
        if (c == 0xB0) {
            int16_t dx = cursorX;
            int16_t dy = y - 6;
            dma_display->drawPixel(dx + 1, dy, 0xFFFF);
            dma_display->drawPixel(dx, dy + 1, 0xFFFF);
            dma_display->drawPixel(dx + 2, dy + 1, 0xFFFF);
            dma_display->drawPixel(dx + 1, dy + 2, 0xFFFF);
            cursorX += 4;
            ptr++;
            dma_display->setCursor(cursorX, y);
            continue;
        }

        // Handle UTF-8 accented characters (common French)
        if (c == 0xC3) {
            uint8_t next = *(ptr + 1);
            char replacement = '?';
            switch (next) {
                case 0xA0: case 0xA2: case 0xA4: replacement = 'a'; break;  // a grave, circumflex, umlaut
                case 0xA8: case 0xA9: case 0xAA: case 0xAB: replacement = 'e'; break;  // e variants
                case 0xAC: case 0xAE: case 0xAF: replacement = 'i'; break;  // i variants
                case 0xB2: case 0xB4: case 0xB6: replacement = 'o'; break;  // o variants
                case 0xB9: case 0xBB: case 0xBC: replacement = 'u'; break;  // u variants
                case 0xA7: replacement = 'c'; break;  // c cedilla
                case 0xB1: replacement = 'n'; break;  // n tilde
                case 0x80: case 0x89: replacement = 'E'; break;  // E accent
                case 0x87: replacement = 'C'; break;  // C cedilla
            }
            dma_display->print(replacement);
            cursorX += charWidth;
            ptr += 2;
            dma_display->setCursor(cursorX, y);
            continue;
        }

        // Standard ASCII character
        if (c >= 32 && c <= 126) {
            dma_display->print((char)c);
            cursorX += charWidth;
        }
        // Skip other non-printable characters

        ptr++;
        dma_display->setCursor(cursorX, y);
    }
}

// Draw text with per-segment coloring (NULL font, 6px/char)
// segmentCount==0: uses defaultColor and delegates to printTextWithSpecialChars
// segmentCount>0: switches color at segment boundaries
void printTextWithSegments(const char* text, int16_t x, int16_t y,
                           uint32_t defaultColor, const TextSegment* segments, uint8_t segmentCount) {
    if (segmentCount == 0) {
        uint8_t r = (defaultColor >> 16) & 0xFF;
        uint8_t g = (defaultColor >> 8) & 0xFF;
        uint8_t b = defaultColor & 0xFF;
        dma_display->setTextColor(dma_display->color565(r, g, b));
        printTextWithSpecialChars(text, x, y);
        return;
    }

    const uint8_t charWidth = 6;
    int16_t cursorX = x;
    dma_display->setCursor(cursorX, y);

    // Start with first segment color or default
    uint8_t currentSegment = 0;
    uint32_t currentColor = (segmentCount > 0) ? segments[0].color : defaultColor;
    uint8_t r = (currentColor >> 16) & 0xFF;
    uint8_t g = (currentColor >> 8) & 0xFF;
    uint8_t b = currentColor & 0xFF;
    uint16_t color565 = dma_display->color565(r, g, b);
    dma_display->setTextColor(color565);

    uint8_t charIndex = 0;  // Visual char index (UTF-8 multi-byte = 1 visual char)
    const uint8_t* ptr = (const uint8_t*)text;

    while (*ptr) {
        // Check if we need to switch to next segment color
        if (currentSegment + 1 < segmentCount && charIndex >= segments[currentSegment + 1].offset) {
            currentSegment++;
            currentColor = segments[currentSegment].color;
            r = (currentColor >> 16) & 0xFF;
            g = (currentColor >> 8) & 0xFF;
            b = currentColor & 0xFF;
            color565 = dma_display->color565(r, g, b);
            dma_display->setTextColor(color565);
        }

        uint8_t c = *ptr;

        // Handle UTF-8 degree symbol (C2 B0)
        if (c == 0xC2 && *(ptr + 1) == 0xB0) {
            int16_t dx = cursorX;
            int16_t dy = y - 6;
            dma_display->drawPixel(dx + 1, dy, color565);
            dma_display->drawPixel(dx, dy + 1, color565);
            dma_display->drawPixel(dx + 2, dy + 1, color565);
            dma_display->drawPixel(dx + 1, dy + 2, color565);
            cursorX += 4;
            ptr += 2;
            charIndex++;
            dma_display->setCursor(cursorX, y);
            continue;
        }

        // Handle Latin-1 degree symbol (direct byte 0xB0)
        if (c == 0xB0) {
            int16_t dx = cursorX;
            int16_t dy = y - 6;
            dma_display->drawPixel(dx + 1, dy, color565);
            dma_display->drawPixel(dx, dy + 1, color565);
            dma_display->drawPixel(dx + 2, dy + 1, color565);
            dma_display->drawPixel(dx + 1, dy + 2, color565);
            cursorX += 4;
            ptr++;
            charIndex++;
            dma_display->setCursor(cursorX, y);
            continue;
        }

        // Handle UTF-8 accented characters (common French)
        if (c == 0xC3) {
            uint8_t next = *(ptr + 1);
            char replacement = '?';
            switch (next) {
                case 0xA0: case 0xA2: case 0xA4: replacement = 'a'; break;
                case 0xA8: case 0xA9: case 0xAA: case 0xAB: replacement = 'e'; break;
                case 0xAC: case 0xAE: case 0xAF: replacement = 'i'; break;
                case 0xB2: case 0xB4: case 0xB6: replacement = 'o'; break;
                case 0xB9: case 0xBB: case 0xBC: replacement = 'u'; break;
                case 0xA7: replacement = 'c'; break;
                case 0xB1: replacement = 'n'; break;
                case 0x80: case 0x89: replacement = 'E'; break;
                case 0x87: replacement = 'C'; break;
            }
            dma_display->print(replacement);
            cursorX += charWidth;
            ptr += 2;
            charIndex++;
            dma_display->setCursor(cursorX, y);
            continue;
        }

        // Standard ASCII character
        if (c >= 32 && c <= 126) {
            dma_display->print((char)c);
            cursorX += charWidth;
            charIndex++;
        }

        ptr++;
        dma_display->setCursor(cursorX, y);
    }
}

// Draw label text with per-segment coloring (TomThumb font, baseline positioning)
// dimDefault=true + segmentCount==0: dims defaultColor 50% (standard label behavior)
// dimDefault=false: uses defaultColor as-is (compact text in half-width zones)
// segmentCount>0: uses segment colors at full brightness
void printLabelWithSegments(const char* text, int16_t x, int16_t y,
                            uint32_t defaultColor, const TextSegment* segments, uint8_t segmentCount,
                            bool dimDefault) {
    dma_display->setFont(&TomThumb);

