nicolas-codemate/esp32-pixelcast/src/main.cpp
    if (segmentCount == 0) {
        uint8_t r = (defaultColor >> 16) & 0xFF;
        uint8_t g = (defaultColor >> 8) & 0xFF;
        uint8_t b = defaultColor & 0xFF;
        if (dimDefault) {
            r = r * 3 / 4;
            g = g * 3 / 4;
            b = b * 3 / 4;
        }
        dma_display->setTextColor(dma_display->color565(r, g, b));
        dma_display->setCursor(x, y);
        dma_display->print(text);
        dma_display->setFont(NULL);
        return;
    }

    // Per-segment coloring - let GFX library handle cursor advancement
    dma_display->setCursor(x, y);

    uint8_t currentSegment = 0;
    uint32_t currentColor = segments[0].color;
    uint8_t r = (currentColor >> 16) & 0xFF;
    uint8_t g = (currentColor >> 8) & 0xFF;
    uint8_t b = currentColor & 0xFF;
    dma_display->setTextColor(dma_display->color565(r, g, b));

    uint8_t charIndex = 0;
    const char* ptr = text;

    while (*ptr) {
        // Check if we need to switch to next segment color
        if (currentSegment + 1 < segmentCount && charIndex >= segments[currentSegment + 1].offset) {
            currentSegment++;
            currentColor = segments[currentSegment].color;
            r = (currentColor >> 16) & 0xFF;
            g = (currentColor >> 8) & 0xFF;
            b = currentColor & 0xFF;
            dma_display->setTextColor(dma_display->color565(r, g, b));
        }

        dma_display->print(*ptr);
        charIndex++;
        ptr++;
    }

    dma_display->setFont(NULL);
}

// ============================================================================
// Icon Functions
// ============================================================================

void initIconCache() {
    for (uint8_t i = 0; i < MAX_ICON_CACHE; i++) {
        iconCache[i].name[0] = '\0';
        iconCache[i].pixels = nullptr;
        iconCache[i].width = 0;
        iconCache[i].height = 0;
        iconCache[i].valid = false;
        iconCache[i].lastUsed = 0;
    }
    Serial.println("[ICON] Cache initialized");
}

int pngDrawCallback(PNGDRAW *pDraw) {
    if (!pngDecodeTarget || pDraw->y >= 16) return 1;

    // Debug: log pixel type on first line
    if (pDraw->y == 0) {
        Serial.printf("[PNG] PixelType=%d, Width=%d, BPP=%d, HasAlpha=%d\n",
            pDraw->iPixelType, pDraw->iWidth, pDraw->iBpp, pDraw->iHasAlpha);
    }

    uint16_t* dest = pngDecodeTarget + (pDraw->y * pngDecodeWidth);
    uint16_t pixel;

    for (int x = 0; x < pDraw->iWidth && x < pngDecodeWidth; x++) {
        // Get RGBA values from source
        uint8_t r, g, b, a;
        if (pDraw->iPixelType == PNG_PIXEL_TRUECOLOR_ALPHA) {
            // RGBA: 4 bytes per pixel
            uint8_t* src = pDraw->pPixels + (x * 4);
            r = src[0];
            g = src[1];
            b = src[2];
            a = src[3];
        } else if (pDraw->iPixelType == PNG_PIXEL_INDEXED) {
            // Indexed: use palette lookup
            uint8_t idx = pDraw->pPixels[x];
            if (pDraw->pPalette) {
                r = pDraw->pPalette[idx * 3];
                g = pDraw->pPalette[idx * 3 + 1];
                b = pDraw->pPalette[idx * 3 + 2];
                a = pDraw->iHasAlpha ? 255 : 255;  // TODO: handle alpha palette
            } else {
                r = g = b = idx;
                a = 255;
            }
        } else if (pDraw->iPixelType == PNG_PIXEL_TRUECOLOR) {
            // RGB: 3 bytes per pixel
            uint8_t* src = pDraw->pPixels + (x * 3);
            r = src[0];
            g = src[1];
            b = src[2];
            a = 255;
        } else {
            // Grayscale or other
            r = g = b = pDraw->pPixels[x];
            a = 255;
        }

        // Debug: log first non-black pixel on line 10
        if (pDraw->y == 10 && x < 20 && (r > 50 || g > 50 || b > 50)) {
            Serial.printf("[PNG] y=10 x=%d: R=%d G=%d B=%d A=%d\n", x, r, g, b, a);
        }

        // Convert to RGB565
        if (a < 128) {
            pixel = 0;  // Transparent = black
        } else {
            pixel = ((r & 0xF8) << 8) | ((g & 0xFC) << 3) | (b >> 3);
        }
        dest[x] = pixel;
    }
    return 1;
}

int8_t findLRUSlot() {
    int8_t lruIndex = -1;
    unsigned long oldestTime = UINT32_MAX;

    for (uint8_t i = 0; i < MAX_ICON_CACHE; i++) {
        // First check for empty slots
        if (!iconCache[i].valid) {
            return i;
        }
        // Then find least recently used
        if (iconCache[i].lastUsed < oldestTime) {
            oldestTime = iconCache[i].lastUsed;
            lruIndex = i;
        }
    }

    // Free the LRU slot
    if (lruIndex >= 0 && iconCache[lruIndex].pixels) {
        free(iconCache[lruIndex].pixels);
        iconCache[lruIndex].pixels = nullptr;
        iconCache[lruIndex].valid = false;
        Serial.printf("[ICON] Evicted icon: %s\n", iconCache[lruIndex].name);
    }

    return lruIndex;
}

CachedIcon* loadIcon(const char* name) {
    if (!name || strlen(name) == 0) return nullptr;
    if (!filesystemReady) return nullptr;

    // Build file path
    char filePath[64];
    snprintf(filePath, sizeof(filePath), "%s/%s.png", FS_ICONS_PATH, name);

    // Check if file exists
    if (!LittleFS.exists(filePath)) {
        Serial.printf("[ICON] File not found: %s\n", filePath);
        return nullptr;
    }

    // Find a cache slot
    int8_t slot = findLRUSlot();
    if (slot < 0) {
        Serial.println("[ICON] No cache slots available");
        return nullptr;
    }

    CachedIcon* cached = &iconCache[slot];

    // Open file
    File file = LittleFS.open(filePath, "r");
    if (!file) {
        Serial.printf("[ICON] Failed to open: %s\n", filePath);
        return nullptr;
    }

    // Read file into buffer
    size_t fileSize = file.size();
    uint8_t* fileBuffer = (uint8_t*)malloc(fileSize);
    if (!fileBuffer) {
        file.close();
        Serial.println("[ICON] Failed to allocate file buffer");
        return nullptr;
    }
    file.read(fileBuffer, fileSize);
    file.close();

    // Initialize PNG decoder
    int rc = png.openRAM(fileBuffer, fileSize, pngDrawCallback);
    if (rc != PNG_SUCCESS) {
        free(fileBuffer);
        Serial.printf("[ICON] PNG open failed: %d\n", rc);
        return nullptr;
    }

    // Get dimensions (limit to 32x32 to preserve RAM)
    uint8_t width = min((int)png.getWidth(), 32);
    uint8_t height = min((int)png.getHeight(), 32);

    // Allocate pixel buffer
    cached->pixels = (uint16_t*)malloc(width * height * sizeof(uint16_t));
    if (!cached->pixels) {
        png.close();
        free(fileBuffer);
        Serial.println("[ICON] Failed to allocate pixel buffer");
        return nullptr;
    }

    // Set up decode target
    pngDecodeTarget = cached->pixels;
    pngDecodeWidth = width;

    // Clear buffer
    memset(cached->pixels, 0, width * height * sizeof(uint16_t));

    // Decode PNG
    rc = png.decode(NULL, 0);
    png.close();
    free(fileBuffer);

    if (rc != PNG_SUCCESS) {
        free(cached->pixels);
        cached->pixels = nullptr;
        Serial.printf("[ICON] PNG decode failed: %d\n", rc);
        return nullptr;
    }

    // Update cache entry
    strlcpy(cached->name, name, sizeof(cached->name));
    cached->width = width;
    cached->height = height;
    cached->valid = true;
    cached->lastUsed = millis();

    Serial.printf("[ICON] Loaded: %s (%dx%d)\n", name, width, height);
    return cached;
}

bool isFailedIconDownload(const char* name) {
    unsigned long now = millis();
    for (uint8_t i = 0; i < MAX_FAILED_ICON_DOWNLOADS; i++) {
        if (failedIconDownloads[i].name[0] != '\0' &&
            strcmp(failedIconDownloads[i].name, name) == 0 &&
            (now - failedIconDownloads[i].failedAt) < FAILED_ICON_RETRY_DELAY) {
            return true;
        }
    }
    return false;
}

