nicolas-codemate/esp32-pixelcast/src/main.cpp
    return true;
}

void handleApiIconsList(AsyncWebServerRequest *request) {
    JsonDocument doc;
    JsonArray icons = doc["icons"].to<JsonArray>();

    File root = LittleFS.open(FS_ICONS_PATH);
    if (root && root.isDirectory()) {
        File file = root.openNextFile();
        while (file) {
            if (!file.isDirectory()) {
                JsonObject obj = icons.add<JsonObject>();
                String filename = String(file.name());
                // Remove path prefix if present
                int lastSlash = filename.lastIndexOf('/');
                if (lastSlash >= 0) {
                    filename = filename.substring(lastSlash + 1);
                }
                // Remove extension for the name
                int lastDot = filename.lastIndexOf('.');
                String name = lastDot > 0 ? filename.substring(0, lastDot) : filename;
                obj["name"] = name;
                obj["filename"] = filename;
                obj["size"] = file.size();
            }
            file = root.openNextFile();
        }
        root.close();
    }

    doc["count"] = icons.size();
    doc["storage"]["used"] = LittleFS.usedBytes();
    doc["storage"]["total"] = LittleFS.totalBytes();

    String response;
    serializeJson(doc, response);
    request->send(200, "application/json", response);
}

void handleApiIconsServe(AsyncWebServerRequest *request, const String& name) {
    // Try PNG first, then GIF
    String pngPath = String(FS_ICONS_PATH) + "/" + name + ".png";
    String gifPath = String(FS_ICONS_PATH) + "/" + name + ".gif";

    if (LittleFS.exists(pngPath)) {
        request->send(LittleFS, pngPath, "image/png");
    } else if (LittleFS.exists(gifPath)) {
        request->send(LittleFS, gifPath, "image/gif");
    } else {
        request->send(404, "application/json", "{\"error\":\"Icon not found\"}");
    }
}

void handleApiIconsDelete(AsyncWebServerRequest *request) {
    if (!request->hasParam("name")) {
        request->send(400, "application/json", "{\"error\":\"Missing name parameter\"}");
        return;
    }

    String name = request->getParam("name")->value();

    // Invalidate cache first
    invalidateCachedIcon(name.c_str());

    // Try to delete PNG or GIF
    String pngPath = String(FS_ICONS_PATH) + "/" + name + ".png";
    String gifPath = String(FS_ICONS_PATH) + "/" + name + ".gif";

    bool deleted = false;
    if (LittleFS.exists(pngPath)) {
        deleted = LittleFS.remove(pngPath);
    } else if (LittleFS.exists(gifPath)) {
        deleted = LittleFS.remove(gifPath);
    }

    if (deleted) {
        Serial.printf("[ICON] Deleted: %s\n", name.c_str());
        request->send(200, "application/json", "{\"success\":true}");
    } else {
        request->send(404, "application/json", "{\"error\":\"Icon not found\"}");
    }
}

// ============================================================================
// WiFi Functions
// ============================================================================

void setupWiFi() {
    wifiManager.setConfigPortalTimeout(180);
    wifiManager.setAPCallback([](WiFiManager *myWiFiManager) {
        Serial.println("[WIFI] Config portal started");
        dma_display->clearScreen();
        dma_display->setTextColor(dma_display->color565(255, 165, 0));
        dma_display->setCursor(4, 20);
        dma_display->print("WiFi Setup");
        dma_display->setTextColor(dma_display->color565(255, 255, 255));
        dma_display->setCursor(4, 35);
        dma_display->print(WIFI_AP_NAME);
        #if DOUBLE_BUFFER
            dma_display->flipDMABuffer();
        #endif
    });

    wifiConnected = wifiManager.autoConnect(WIFI_AP_NAME);

    if (wifiConnected) {
        Serial.print("[WIFI] Connected! IP: ");
        Serial.println(WiFi.localIP());
    } else {
        Serial.println("[WIFI] Failed to connect");
    }
}

void loopWiFi() {
    if (WiFi.status() != WL_CONNECTED && wifiConnected) {
        Serial.println("[WIFI] Connection lost, reconnecting...");
        wifiConnected = false;
        WiFi.reconnect();
    } else if (WiFi.status() == WL_CONNECTED && !wifiConnected) {
        Serial.println("[WIFI] Reconnected!");
        wifiConnected = true;
    }
}

// ============================================================================
// mDNS Functions
// ============================================================================

void setupMDNS() {
    if (MDNS.begin(MDNS_NAME)) {
        MDNS.addService("http", "tcp", WEB_SERVER_PORT);
        Serial.printf("[MDNS] Hostname: %s.local\n", MDNS_NAME);
    } else {
        Serial.println("[MDNS] Failed to start");
    }
}

// ============================================================================
// Web Server Functions
// ============================================================================

void setupWebServer() {
    // CORS headers via DefaultHeaders
    DefaultHeaders::Instance().addHeader("Access-Control-Allow-Origin", "*");
    DefaultHeaders::Instance().addHeader("Access-Control-Allow-Methods", "GET, POST, PUT, DELETE, OPTIONS");
    DefaultHeaders::Instance().addHeader("Access-Control-Allow-Headers", "Content-Type");

    webServer.on("/", HTTP_GET, [](AsyncWebServerRequest *request) {
        request->send(200, "text/html",
            "<!DOCTYPE html><html><head><title>PixelCast</title></head>"
            "<body><h1>ESP32-PixelCast</h1>"
            "<p>Version: " VERSION_STRING "</p>"
            "<p><a href='/icons.html'>Icon Manager</a></p>"
            "<p><a href='/api/stats'>API Stats</a></p>"
            "<p><a href='/api/apps'>Active Apps</a></p>"
            "</body></html>"
        );
    });

    webServer.on("/api/stats", HTTP_GET, handleApiStats);
    webServer.on("/api/settings", HTTP_GET, handleApiSettings);
    webServer.on("/api/apps", HTTP_GET, handleApiApps);

    // POST /api/brightness - Set brightness (using AsyncCallbackJsonWebHandler)
    AsyncCallbackJsonWebHandler* brightnessHandler = new AsyncCallbackJsonWebHandler("/api/brightness",
        [](AsyncWebServerRequest *request, JsonVariant &json) {
            Serial.println("[API] /brightness handler called");
            JsonObject doc = json.as<JsonObject>();

            if (doc.isNull()) {
                request->send(400, "application/json", "{\"error\":\"Invalid JSON\"}");
                return;
            }

