nicolas-codemate/esp32-pixelcast/src/main.cpp
            Serial.printf("[API] LaMetric download request: id=%d, name=%s\n", iconId, name.c_str());

            if (downloadLaMetricIcon(iconId, name.c_str())) {
                request->send(200, "application/json", "{\"success\":true}");
            } else {
                request->send(500, "application/json", "{\"error\":\"Failed to download icon from LaMetric\"}");
            }
        });
    webServer.addHandler(lametricHandler);

    // POST /api/icons?name={name} - Upload icon (multipart/form-data)
    webServer.on("/api/icons", HTTP_POST,
        // Completion handler
        [](AsyncWebServerRequest *request) {
            if (uploadValid && uploadSize > 0) {
                Serial.printf("[ICON] Upload complete: %s (%d bytes)\n",
                              uploadIconName.c_str(), uploadSize);
                request->send(200, "application/json", "{\"success\":true}");
            } else {
                // Clean up failed upload
                if (uploadIconName.length() > 0) {
                    String path = String(FS_ICONS_PATH) + "/" + uploadIconName + ".png";
                    if (LittleFS.exists(path)) {
                        LittleFS.remove(path);
                    }
                    path = String(FS_ICONS_PATH) + "/" + uploadIconName + ".gif";
                    if (LittleFS.exists(path)) {
                        LittleFS.remove(path);
                    }
                }
                request->send(400, "application/json", "{\"error\":\"Upload failed - invalid file format or size\"}");
            }
            // Reset upload state
            uploadIconName = "";
            uploadValid = false;
            uploadSize = 0;
        },
        // Chunk handler for file upload
        [](AsyncWebServerRequest *request, String filename, size_t index,
           uint8_t *data, size_t len, bool final) {

            if (index == 0) {
                // First chunk - initialize upload
                if (!request->hasParam("name")) {
                    Serial.println("[ICON] Upload missing name parameter");
                    uploadValid = false;
                    return;
                }

                uploadIconName = request->getParam("name")->value();
                uploadSize = 0;

                // Validate file header
                bool isPng = validatePngHeader(data, len);
                bool isGif = validateGifHeader(data, len);

                if (!isPng && !isGif) {
                    Serial.println("[ICON] Invalid file format (not PNG or GIF)");
                    uploadValid = false;
                    return;
                }

                // Determine extension based on format
                String ext = isPng ? ".png" : ".gif";
                String path = String(FS_ICONS_PATH) + "/" + uploadIconName + ext;

                uploadFile = LittleFS.open(path, "w");
                if (!uploadFile) {
                    Serial.printf("[ICON] Failed to create file: %s\n", path.c_str());
                    uploadValid = false;
                    return;
                }

                uploadValid = true;
                Serial.printf("[ICON] Upload started: %s\n", path.c_str());
            }

            // Write data chunk
            if (uploadValid && uploadFile) {
                // Check size limit
                if (uploadSize + len > MAX_ICON_SIZE) {
                    Serial.println("[ICON] Upload exceeds size limit");
                    uploadFile.close();
                    uploadValid = false;
                    return;
                }

                size_t written = uploadFile.write(data, len);
                uploadSize += written;
            }

            // Final chunk
            if (final && uploadFile) {
                uploadFile.close();
                if (uploadValid) {
                    // Invalidate cached icon
                    invalidateCachedIcon(uploadIconName.c_str());
                }
            }
        }
    );

    // Handle dynamic routes not caught by static handlers
    webServer.onNotFound([](AsyncWebServerRequest *request) {
        // Handle CORS preflight
        if (request->method() == HTTP_OPTIONS) {
            request->send(200);
            return;
        }

        String url = request->url();
        WebRequestMethodComposite method = request->method();

        // Handle DELETE routes (fallback if static handler misses due to HTTP_DELETE enum conflict)
        const WebRequestMethodComposite HTTP_DELETE_METHOD = 0b00000100;
        if (method == HTTP_DELETE_METHOD && url == "/api/icons") {
            handleApiIconsDelete(request);
            return;
        }
        if (method == HTTP_DELETE_METHOD && url == "/api/tracker") {
            if (!request->hasParam("name")) {
                request->send(400, "application/json", "{\"error\":\"Missing tracker name\"}");
                return;
            }
            String name = request->getParam("name")->value();
            if (trackerRemove(name.c_str())) {
                request->send(200, "application/json", "{\"success\":true}");
            } else {
                request->send(404, "application/json", "{\"error\":\"Tracker not found\"}");
            }
            return;
        }
        if (method == HTTP_DELETE_METHOD && url.startsWith("/api/indicator")) {
            // Extract indicator number from URL (last char)
            char lastChar = url.charAt(url.length() - 1);
            uint8_t idx = lastChar - '1';  // '1'->0, '2'->1, '3'->2
            if (idx < NUM_INDICATORS) {
                indicatorOff(idx);
                saveSettings();
                Serial.printf("[API] Indicator %d turned off (DELETE)\n", idx + 1);
                request->send(200, "application/json", "{\"success\":true,\"mode\":\"off\"}");
            } else {
                request->send(400, "application/json", "{\"error\":\"Invalid indicator number\"}");
            }
            return;
        }
        if (method == HTTP_DELETE_METHOD && url == "/api/custom") {
            if (!request->hasParam("name")) {
                request->send(400, "application/json", "{\"error\":\"Missing app name\"}");
                return;
            }
            String name = request->getParam("name")->value();
            if (appRemove(name.c_str())) {
                request->send(200, "application/json", "{\"success\":true}");
            } else {
                request->send(404, "application/json", "{\"error\":\"App not found or is system app\"}");
            }
            return;
        }

