nicolas-codemate/esp32-pixelcast/src/main.cpp
    uint8_t brightness = doc["brightness"].as<uint8_t>();
    displaySetBrightness(brightness);
    settings.brightness = brightness;
    saveSettings();
    Serial.printf("[MQTT] Brightness set to %d\n", brightness);
}

void mqttHandleCustom(const char* name, JsonObject& doc) {
    // Check for multi-zone format
    JsonArray zonesArray = doc["zones"].as<JsonArray>();
    bool isMultiZone = !zonesArray.isNull() && zonesArray.size() > 0;

    if (isMultiZone) {
        uint8_t zoneCount = zonesArray.size();
        if (zoneCount == 1 || zoneCount > MAX_ZONES) {
            Serial.println("[MQTT] /custom zones array must have 2, 3, or 4 elements");
            return;
        }
    }

    // For multi-zone, zone 0 provides the main fields; for single-zone, use top-level fields
    const char* icon = isMultiZone ? "" : (doc["icon"] | "");
    uint32_t textColor = isMultiZone ? 0xFFFFFF : parseColorValue(doc["color"], 0xFFFFFF);

    // Parse text field (may be string, {text,color} object, or [{t,c},...] array)
    char parsedText[64] = "";
    TextSegment textSegs[MAX_TEXT_SEGMENTS];
    uint8_t textSegCount = 0;
    if (!isMultiZone) {
        parseTextFieldWithSegments(doc["text"], parsedText, sizeof(parsedText),
                                   textSegs, &textSegCount, textColor);
    }

    uint16_t duration = doc["duration"] | settings.defaultDuration;
    uint32_t lifetime = doc["lifetime"] | 0;
    int8_t priority = doc["priority"] | 0;

    int8_t result = appAdd(name, parsedText, icon, textColor,
                           duration, lifetime, priority, false);

    if (result >= 0) {
        if (!isMultiZone) {
            // Copy text segments
            memcpy(apps[result].textSegments, textSegs, sizeof(textSegs));
            apps[result].textSegmentCount = textSegCount;
            // Parse label field
            parseTextFieldWithSegments(doc["label"], apps[result].label,
                                       sizeof(apps[result].label),
                                       apps[result].labelSegments,
                                       &apps[result].labelSegmentCount, textColor);
        }
        // Apply multi-zone data if present
        if (isMultiZone) {
            appSetZones(result, zonesArray);
        }
        Serial.printf("[MQTT] Custom app '%s' created/updated\n", name);
    } else {
        Serial.printf("[MQTT] Failed to add custom app '%s'\n", name);
    }
}

void mqttHandleCustomDelete(const char* name) {
    if (appRemove(name)) {
        Serial.printf("[MQTT] Custom app '%s' deleted\n", name);
    } else {
        Serial.printf("[MQTT] Custom app '%s' not found or is system app\n", name);
    }
}

void mqttHandleNotify(JsonObject& doc) {
    const char* text = doc["text"] | "";
    if (strlen(text) == 0) {
        Serial.println("[MQTT] /notify missing text");
        return;
    }

    const char* id = doc["id"] | "";
    const char* icon = doc["icon"] | "";
    uint32_t textColor = parseColorValue(doc["color"], 0xFFFFFF);
    uint32_t bgColor = parseColorValue(doc["background"], 0x000000);
    uint16_t duration = doc["duration"] | (uint16_t)DEFAULT_NOTIF_DURATION;
    bool hold = doc["hold"] | false;
    bool urgent = doc["urgent"] | false;
    bool stack = doc["stack"] | true;

    int8_t slot = notifAdd(id, text, icon, textColor, bgColor,
                           duration, hold, urgent, stack);

    if (slot >= 0) {
        Serial.printf("[MQTT] Notification added: '%s'\n", text);
    } else {
        Serial.println("[MQTT] Notification queue full");
    }
}

void mqttHandleDismiss() {
    if (notifDismiss()) {
        resetNotifScrollState();
        Serial.println("[MQTT] Notification dismissed");
    } else {
        Serial.println("[MQTT] No active notification to dismiss");
    }
}

void mqttHandleIndicator(uint8_t index, JsonObject& doc) {
    if (index >= NUM_INDICATORS) return;

    // Parse mode string
    const char* modeStr = doc["mode"] | "";
    IndicatorMode mode = INDICATOR_OFF;

    if (strlen(modeStr) > 0) {
        if (strcmp(modeStr, "solid") == 0) mode = INDICATOR_SOLID;
        else if (strcmp(modeStr, "blink") == 0) mode = INDICATOR_BLINK;
        else if (strcmp(modeStr, "fade") == 0) mode = INDICATOR_FADE;
        else if (strcmp(modeStr, "off") == 0) mode = INDICATOR_OFF;
        else {
            Serial.printf("[MQTT] Invalid indicator mode: %s\n", modeStr);
            return;
        }
    } else if (!doc["color"].isNull()) {
        // Default to solid if color provided but no mode
        mode = INDICATOR_SOLID;
    }

    if (mode == INDICATOR_OFF) {
        indicatorOff(index);
        saveSettings();
        Serial.printf("[MQTT] Indicator %d turned off\n", index + 1);
        return;
    }

    uint32_t color = parseColorValue(doc["color"], indicators[index].color);
    uint16_t blinkInterval = doc["blinkInterval"] | (uint16_t)INDICATOR_BLINK_INTERVAL;
    uint16_t fadePeriod = doc["fadePeriod"] | (uint16_t)INDICATOR_FADE_PERIOD;

    indicatorSet(index, mode, color, blinkInterval, fadePeriod);
    saveSettings();

    Serial.printf("[MQTT] Indicator %d set: mode=%s color=0x%06X\n",
                  index + 1, modeStr[0] ? modeStr : "solid", color);
}

void mqttHandleWeather(JsonObject& doc) {
    // Parse current weather
    if (!doc["current"].is<JsonObject>()) {
        Serial.println("[MQTT] /weather missing 'current' object");
        return;
    }

    JsonObject current = doc["current"];
    strlcpy(weatherData.currentIcon, current["icon"] | "", sizeof(weatherData.currentIcon));
    weatherData.currentTemp = current["temp"] | 0;
    weatherData.currentTempMin = current["temp_min"] | 0;
    weatherData.currentTempMax = current["temp_max"] | 0;
    weatherData.currentHumidity = current["humidity"] | 0;

    // Parse forecast (optional, up to MAX_FORECAST_DAYS days)
    if (doc["forecast"].is<JsonArray>()) {
        JsonArray forecastArr = doc["forecast"];
        int forecastSize = min((int)forecastArr.size(), (int)MAX_FORECAST_DAYS);
        for (int i = 0; i < forecastSize; i++) {
            JsonObject fc = forecastArr[i];
            strlcpy(weatherData.forecast[i].icon, fc["icon"] | "", sizeof(weatherData.forecast[i].icon));
            weatherData.forecast[i].tempMin = fc["temp_min"] | 0;
            weatherData.forecast[i].tempMax = fc["temp_max"] | 0;
            strlcpy(weatherData.forecast[i].dayName, fc["day"] | "", sizeof(weatherData.forecast[i].dayName));
        }
        weatherData.forecastCount = forecastSize;
    } else {
        weatherData.forecastCount = 0;
    }

    // Reset forecast pagination on new data
    forecastPage = 0;
    lastForecastPageSwitch = millis();

