nicolas-codemate/esp32-pixelcast/src/main.cpp
    return true;
}

bool saveSettings() {
    if (!filesystemReady) {
        Serial.println("[SETTINGS] Filesystem not ready");
        return false;
    }

    JsonDocument doc;

    // Display settings
    doc["display"]["brightness"] = settings.brightness;
    doc["display"]["autoRotate"] = settings.autoRotate;
    doc["display"]["defaultDuration"] = settings.defaultDuration;
    doc["display"]["colorDepth"] = COLOR_DEPTH;
    doc["display"]["transition"] = "none";

    // WiFi settings
    doc["wifi"]["hostname"] = MDNS_NAME;

    // NTP settings
    doc["ntp"]["server"] = settings.ntpServer;
    doc["ntp"]["tz_posix"] = settings.tzPosix;

    // Clock app settings
    doc["apps"]["clock"]["enabled"] = settings.clockEnabled;
    doc["apps"]["clock"]["format24h"] = settings.clockFormat24h;
    doc["apps"]["clock"]["showSeconds"] = settings.clockShowSeconds;
    char clockColorHex[8];
    formatColorHex(settings.clockColor, clockColorHex, sizeof(clockColorHex));
    doc["apps"]["clock"]["color"] = clockColorHex;

    // Date app settings
    doc["apps"]["date"]["enabled"] = settings.dateEnabled;
    doc["apps"]["date"]["format"] = settings.dateFormat;
    char dateColorHex[8];
    formatColorHex(settings.dateColor, dateColorHex, sizeof(dateColorHex));
    doc["apps"]["date"]["color"] = dateColorHex;

    // MQTT settings
    doc["mqtt"]["enabled"] = settings.mqttEnabled;
    doc["mqtt"]["server"] = settings.mqttServer;
    doc["mqtt"]["port"] = settings.mqttPort;
    doc["mqtt"]["user"] = settings.mqttUser;
    doc["mqtt"]["password"] = settings.mqttPassword;
    doc["mqtt"]["prefix"] = settings.mqttPrefix;

    // Indicators
    for (int i = 0; i < NUM_INDICATORS; i++) {
        String key = String(i + 1);
        const char* modeStr = "off";
        switch (indicators[i].mode) {
            case INDICATOR_SOLID: modeStr = "solid"; break;
            case INDICATOR_BLINK: modeStr = "blink"; break;
            case INDICATOR_FADE:  modeStr = "fade";  break;
            default: break;
        }
        doc["indicators"][key]["mode"] = modeStr;
        char indicatorColorHex[8];
        formatColorHex(indicators[i].color, indicatorColorHex, sizeof(indicatorColorHex));
        doc["indicators"][key]["color"] = indicatorColorHex;
        doc["indicators"][key]["blinkInterval"] = indicators[i].blinkInterval;
        doc["indicators"][key]["fadePeriod"] = indicators[i].fadePeriod;
    }

    // Sleep settings
    doc["sleep"]["enabled"] = settings.sleep.enabled;
    doc["sleep"]["displayMode"] = settings.sleep.displayMode;
    doc["sleep"]["sleepUntilEpoch"] = settings.sleep.sleepUntilEpoch;

    for (int day = 0; day < 7; day++) {
        String dayKey = String(day);
        doc["sleep"]["days"][dayKey]["allDay"] = settings.sleep.days[day].allDay;

        JsonArray slotsArr = doc["sleep"]["days"][dayKey]["slots"].to<JsonArray>();
        for (uint8_t slotIndex = 0; slotIndex < settings.sleep.days[day].slotCount; slotIndex++) {
            const SleepSlot& slot = settings.sleep.days[day].slots[slotIndex];
            JsonObject slotObj = slotsArr.add<JsonObject>();
            slotObj["startHour"]   = slot.startHour;
            slotObj["startMinute"] = slot.startMinute;
            slotObj["endHour"]     = slot.endHour;
            slotObj["endMinute"]   = slot.endMinute;
        }
    }

    File file = LittleFS.open(FS_CONFIG_FILE, "w");
    if (!file) {
        Serial.println("[SETTINGS] Failed to open config file for writing");
        return false;
    }

    serializeJsonPretty(doc, file);
    file.close();

    Serial.println("[SETTINGS] Configuration saved successfully");
    return true;
}

bool loadApps() {
    if (!filesystemReady) {
        Serial.println("[APPS] Filesystem not ready, cannot load apps");
        return false;
    }

    File file = LittleFS.open(FS_APPS_FILE, "r");
    if (!file) {
        Serial.println("[APPS] Apps file not found, starting fresh");
        return false;
    }

    JsonDocument doc;
    DeserializationError error = deserializeJson(doc, file);
    file.close();

    if (error) {
        Serial.printf("[APPS] JSON parse error: %s\n", error.c_str());
        return false;
    }

    int loadedCount = 0;
    JsonArray appsArray = doc["apps"];
    for (JsonObject appObj : appsArray) {
        const char* id = appObj["id"] | "";
        const char* icon = appObj["icon"] | "";
        uint32_t textColor = appObj["textColor"] | 0xFFFFFF;
        uint16_t duration = appObj["duration"] | settings.defaultDuration;
        uint32_t lifetime = appObj["lifetime"] | 0;
        int8_t priority = appObj["priority"] | 0;

        // Parse text field (handles string and [{t,c},...] array from persistence)
        char parsedText[64] = "";
        TextSegment textSegs[MAX_TEXT_SEGMENTS];
        uint8_t textSegCount = 0;
        parseTextFieldWithSegments(appObj["text"], parsedText, sizeof(parsedText),
                                   textSegs, &textSegCount, textColor);

        if (strlen(id) > 0) {
            int8_t result = appAdd(id, parsedText, icon, textColor,
                                   duration, lifetime, priority, false);
            if (result >= 0) {
                // Restore text segments
                memcpy(apps[result].textSegments, textSegs, sizeof(textSegs));
                apps[result].textSegmentCount = textSegCount;
                // Restore label with segments
                parseTextFieldWithSegments(appObj["label"], apps[result].label,
                                           sizeof(apps[result].label),
                                           apps[result].labelSegments,
                                           &apps[result].labelSegmentCount, textColor);
                // Restore multi-zone data if present
                JsonArray zonesArr = appObj["zones"].as<JsonArray>();
                if (!zonesArr.isNull() && zonesArr.size() >= 2) {
                    appSetZones(result, zonesArr);
                }
                loadedCount++;
            }
        }
    }

    Serial.printf("[APPS] Loaded %d custom apps from storage\n", loadedCount);
    return loadedCount > 0;
}

