nicolas-codemate/esp32-pixelcast/src/main.cpp
bool saveApps() {
    if (!filesystemReady) {
        Serial.println("[APPS] Filesystem not ready, cannot save apps");
        return false;
    }

    JsonDocument doc;
    doc["version"] = 1;
    JsonArray appsArray = doc["apps"].to<JsonArray>();

    int savedCount = 0;
    for (uint8_t i = 0; i < MAX_APPS; i++) {
        if (apps[i].active && !apps[i].isSystem) {
            JsonObject appObj = appsArray.add<JsonObject>();
            appObj["id"] = apps[i].id;
            appObj["icon"] = apps[i].icon;
            appObj["textColor"] = apps[i].textColor;
            appObj["duration"] = apps[i].duration;
            appObj["lifetime"] = apps[i].lifetime;
            appObj["priority"] = apps[i].priority;
            // Serialize text and label in polymorphic format
            serializeTextField(appObj, "text", apps[i].text,
                               apps[i].textSegments, apps[i].textSegmentCount);
            if (apps[i].label[0] != '\0') {
                serializeTextField(appObj, "label", apps[i].label,
                                   apps[i].labelSegments, apps[i].labelSegmentCount);
            }

            // Serialize multi-zone data
            if (apps[i].zoneCount >= 2) {
                appObj["zoneCount"] = apps[i].zoneCount;
                JsonArray zonesArr = appObj["zones"].to<JsonArray>();
                // Zone 0 = main app fields (text/icon/textColor/label)
                JsonObject z0 = zonesArr.add<JsonObject>();
                serializeTextField(z0, "text", apps[i].text,
                                   apps[i].textSegments, apps[i].textSegmentCount);
                z0["icon"] = apps[i].icon;
                if (apps[i].label[0] != '\0') {
                    serializeTextField(z0, "label", apps[i].label,
                                       apps[i].labelSegments, apps[i].labelSegmentCount);
                }
                char z0ColorHex[8];
                formatColorHex(apps[i].textColor, z0ColorHex, sizeof(z0ColorHex));
                z0["color"] = z0ColorHex;
                // Zones 1..N stored in app->zones[0..N-1]
                for (uint8_t z = 1; z < apps[i].zoneCount; z++) {
                    JsonObject zObj = zonesArr.add<JsonObject>();
                    serializeTextField(zObj, "text", apps[i].zones[z - 1].text,
                                       apps[i].zones[z - 1].textSegments,
                                       apps[i].zones[z - 1].textSegmentCount);
                    zObj["icon"] = apps[i].zones[z - 1].icon;
                    if (apps[i].zones[z - 1].label[0] != '\0') {
                        serializeTextField(zObj, "label", apps[i].zones[z - 1].label,
                                           apps[i].zones[z - 1].labelSegments,
                                           apps[i].zones[z - 1].labelSegmentCount);
                    }
                    char zColorHex[8];
                    formatColorHex(apps[i].zones[z - 1].textColor, zColorHex, sizeof(zColorHex));
                    zObj["color"] = zColorHex;
                }
            }

            savedCount++;
        }
    }

    File file = LittleFS.open(FS_APPS_FILE, "w");
    if (!file) {
        Serial.println("[APPS] Failed to open apps file for writing");
        return false;
    }

    serializeJsonPretty(doc, file);
    file.close();

    Serial.printf("[APPS] Saved %d custom apps to storage\n", savedCount);
    return true;
}

// ============================================================================
// Application Manager Functions
// ============================================================================

void setupApps() {
    // Initialize app array
    memset(apps, 0, sizeof(apps));
    appCount = 0;
    currentAppIndex = -1;

    // Add system apps
    // NOTE: clock and date disabled while weatherclock is in development
    // if (settings.clockEnabled) {
    //     appAdd("clock", "Clock", "", settings.clockColor,
    //            settings.defaultDuration, 0, 0, true);
    //     Serial.println("[APPS] Clock app added");
    // }
    //
    // if (settings.dateEnabled) {
    //     appAdd("date", "Date", "", settings.dateColor,
    //            settings.defaultDuration, 0, 0, true);
    //     Serial.println("[APPS] Date app added");
    // }

    // WeatherClock system app (replaces clock+date when weather data is available)
    appAdd("weatherclock", "WeatherClock", "", settings.clockColor,
           settings.defaultDuration, 0, 1, true);
    Serial.println("[APPS] WeatherClock app added");

    // Load persisted custom apps
    // NOTE: disabled during weatherclock development to avoid old "weather" app interference
    // loadApps();

    Serial.printf("[APPS] Initialized with %d apps\n", appCount);
    appRotationEnabled = settings.autoRotate;
}

int8_t appAdd(const char* id, const char* text, const char* icon,
              uint32_t textColor, uint16_t duration,
              uint32_t lifetime, int8_t priority, bool isSystem) {

    // Check if app with same ID exists
    int8_t existingIndex = appFind(id);
    if (existingIndex >= 0) {
        // Update existing app
        AppItem* app = &apps[existingIndex];
        strlcpy(app->text, text, sizeof(app->text));
        if (icon) strlcpy(app->icon, icon, sizeof(app->icon));
        app->label[0] = '\0';  // Reset label (caller will set if needed)
        app->textColor = textColor;
        app->textSegmentCount = 0;
        app->labelSegmentCount = 0;
        app->duration = duration;
        app->lifetime = lifetime;
        app->priority = priority;
        app->createdAt = millis();
        app->active = true;
        // Reset zone data (caller will set via appSetZones if needed)
        app->zoneCount = 0;
        memset(app->zones, 0, sizeof(app->zones));
        Serial.printf("[APPS] Updated app: %s\n", id);
        // Persist non-system apps
        if (!app->isSystem) {
            saveApps();
        }
        return existingIndex;
    }

    // Find empty slot
    int8_t emptySlot = -1;
    for (uint8_t i = 0; i < MAX_APPS; i++) {
        if (!apps[i].active) {
            emptySlot = i;
            break;
        }
    }

    if (emptySlot < 0) {
        Serial.println("[APPS] No empty slot available");
        return -1;
    }

