nicolas-codemate/esp32-pixelcast/src/main.cpp
    // Create new app
    AppItem* app = &apps[emptySlot];
    strlcpy(app->id, id, sizeof(app->id));
    strlcpy(app->text, text, sizeof(app->text));
    if (icon) strlcpy(app->icon, icon, sizeof(app->icon));
    else app->icon[0] = '\0';
    app->label[0] = '\0';  // Initialize label (caller will set if needed)
    app->textColor = textColor;
    app->textSegmentCount = 0;
    app->labelSegmentCount = 0;
    app->duration = duration > 0 ? duration : settings.defaultDuration;
    app->lifetime = lifetime;
    app->createdAt = millis();
    app->priority = constrain(priority, -10, 10);
    app->active = true;
    app->isSystem = isSystem;
    // Initialize zone data (caller will set via appSetZones if needed)
    app->zoneCount = 0;
    memset(app->zones, 0, sizeof(app->zones));

    appCount++;
    Serial.printf("[APPS] Added app: %s (slot %d, total %d)\n", id, emptySlot, appCount);

    // Persist non-system apps
    if (!isSystem) {
        saveApps();
    }

    return emptySlot;
}

void appSetZones(int8_t appIndex, JsonArray zonesArray) {
    if (appIndex < 0 || appIndex >= MAX_APPS) return;

    AppItem* app = &apps[appIndex];
    uint8_t count = zonesArray.size();
    if (count < 2 || count > MAX_ZONES) return;

    app->zoneCount = count;

    // Zone 0 maps to the app's main text/icon/textColor/label fields
    JsonObject zone0 = zonesArray[0].as<JsonObject>();
    strlcpy(app->icon, zone0["icon"] | "", sizeof(app->icon));
    app->textColor = parseColorValue(zone0["color"], 0xFFFFFF);
    parseTextFieldWithSegments(zone0["text"], app->text, sizeof(app->text),
                               app->textSegments, &app->textSegmentCount, app->textColor);
    parseTextFieldWithSegments(zone0["label"], app->label, sizeof(app->label),
                               app->labelSegments, &app->labelSegmentCount, app->textColor);

    // Zones 1-3 map to app->zones[0..2]
    for (uint8_t i = 1; i < count && i < MAX_ZONES; i++) {
        JsonObject zoneObj = zonesArray[i].as<JsonObject>();
        strlcpy(app->zones[i - 1].icon, zoneObj["icon"] | "", sizeof(app->zones[0].icon));
        app->zones[i - 1].textColor = parseColorValue(zoneObj["color"], 0xFFFFFF);
        parseTextFieldWithSegments(zoneObj["text"], app->zones[i - 1].text,
                                   sizeof(app->zones[0].text),
                                   app->zones[i - 1].textSegments,
                                   &app->zones[i - 1].textSegmentCount,
                                   app->zones[i - 1].textColor);
        parseTextFieldWithSegments(zoneObj["label"], app->zones[i - 1].label,
                                   sizeof(app->zones[0].label),
                                   app->zones[i - 1].labelSegments,
                                   &app->zones[i - 1].labelSegmentCount,
                                   app->zones[i - 1].textColor);
    }

    Serial.printf("[APPS] Set %d zones for app: %s\n", count, app->id);

    // Persist non-system apps
    if (!app->isSystem) {
        saveApps();
    }
}

bool appRemove(const char* id) {
    int8_t index = appFind(id);
    if (index < 0) return false;

    AppItem* app = &apps[index];
    if (app->isSystem) {
        Serial.printf("[APPS] Cannot remove system app: %s\n", id);
        return false;
    }

    app->active = false;
    appCount--;

    // If removing current app, move to next
    if (currentAppIndex == index) {
        currentAppIndex = -1;
    }

    Serial.printf("[APPS] Removed app: %s\n", id);

    // Persist the removal
    saveApps();

    return true;
}

bool appUpdate(const char* id, const char* text, const char* icon,
               uint32_t textColor) {
    int8_t index = appFind(id);
    if (index < 0) return false;

    AppItem* app = &apps[index];
    if (text) strlcpy(app->text, text, sizeof(app->text));
    if (icon) strlcpy(app->icon, icon, sizeof(app->icon));
    if (textColor != 0) app->textColor = textColor;
    app->createdAt = millis();

    Serial.printf("[APPS] Updated app: %s\n", id);
    return true;
}

int8_t appFind(const char* id) {
    for (uint8_t i = 0; i < MAX_APPS; i++) {
        if (apps[i].active && strcmp(apps[i].id, id) == 0) {
            return i;
        }
    }
    return -1;
}

void appCleanExpired() {
    unsigned long now = millis();
    for (uint8_t i = 0; i < MAX_APPS; i++) {
        if (apps[i].active && apps[i].lifetime > 0) {
            if (now - apps[i].createdAt > apps[i].lifetime) {
                Serial.printf("[APPS] App expired: %s\n", apps[i].id);
                apps[i].active = false;
                appCount--;
                if (currentAppIndex == i) {
                    currentAppIndex = -1;
                }
            }
        }
    }
}

AppItem* appGetNext() {
    if (appCount == 0) return nullptr;

    // Clean expired apps first
    appCleanExpired();
    if (appCount == 0) return nullptr;

    // Simple round-robin: find next active app after current
    int8_t startIndex = (currentAppIndex + 1) % MAX_APPS;

    for (uint8_t i = 0; i < MAX_APPS; i++) {
        int8_t idx = (startIndex + i) % MAX_APPS;
        if (apps[idx].active) {
            currentAppIndex = idx;
            return &apps[idx];
        }
    }

    return nullptr;
}

AppItem* appGetCurrent() {
    if (currentAppIndex >= 0 && currentAppIndex < MAX_APPS && apps[currentAppIndex].active) {
        return &apps[currentAppIndex];
    }
    return nullptr;
}

void loopApps() {
    if (!wifiConnected) return;
    if (sleepIsActive()) return;

    // ---- Notification priority check (before app rotation) ----
    unsigned long now = millis();

    NotificationItem* currentNotif = notifGetCurrent();

    // Check if current notification has expired
    if (currentNotif && notifIsExpired(currentNotif)) {
        notifDismiss();
        resetNotifScrollState();
        currentNotif = notifGetNext();  // Try next in queue
        if (currentNotif) {
            resetNotifScrollState();
            // Draw twice to flush both DMA buffers
            displayShowNotification(currentNotif);
            displayShowNotification(currentNotif);
            lastDisplayUpdate = now;
        }
    }

