nicolas-codemate/esp32-pixelcast/src/main.cpp
    // If no current notification, check if new ones are queued
    if (!notifGetCurrent()) {
        currentNotif = notifGetNext();
        if (currentNotif) {
            // Save current app index to restore later (first time only)
            if (savedAppIndex < 0) {
                savedAppIndex = currentAppIndex;
            }
            resetNotifScrollState();
            // Draw twice to flush both DMA buffers (prevents weather ghosting)
            displayShowNotification(currentNotif);
            displayShowNotification(currentNotif);
            lastDisplayUpdate = now;
        }
    }

    // If a notification is active, skip app rotation
    if (notifGetCurrent()) {
        return;
    }

    // Just finished all notifications: restore app rotation
    if (savedAppIndex >= 0) {
        currentAppIndex = savedAppIndex;
        savedAppIndex = -1;
        lastAppSwitch = now;
        resetScrollState();
        // Reset weather clock cache to force full redraw (not just seconds update)
        weatherLastDrawnMinute = -1;
        weatherLastUpdateDrawn = 0;
        Serial.println("[NOTIF] All dismissed, resuming app rotation");
        // Clear both DMA buffers to remove any notification pixel remnants,
        // then force immediate app redraw on both buffers
        dma_display->clearScreen();
        #if DOUBLE_BUFFER
            dma_display->flipDMABuffer();
        #endif
        dma_display->clearScreen();
        #if DOUBLE_BUFFER
            dma_display->flipDMABuffer();
        #endif
        AppItem* restored = appGetCurrent();
        if (restored) {
            displayShowApp(restored);
            displayShowApp(restored);
            lastDisplayUpdate = now;
        }
    }

    // ---- Normal app rotation ----
    if (appCount == 0) return;

    AppItem* current = appGetCurrent();

    if (current == nullptr) {
        // No current app, get first one
        current = appGetNext();
        if (current) {
            lastAppSwitch = now;
            resetScrollState();
            // Force immediate redraw
            displayShowApp(current);
            lastDisplayUpdate = now;
        }
        return;
    }

    // Check if current app duration has elapsed
    if (appRotationEnabled && (now - lastAppSwitch > current->duration)) {
        current = appGetNext();
        if (current) {
            lastAppSwitch = now;
            resetScrollState();
            Serial.printf("[APPS] Switched to: %s\n", current->id);
            // Force immediate redraw on app switch
            displayShowApp(current);
            lastDisplayUpdate = now;
        }
    }
}

// ============================================================================
// Time Functions
// ============================================================================

// Returns an epoch in the *local* time frame so legacy consumers
// (sleep schedule, gmtime-based decoding) keep working without
// adding the offset themselves. Real UTC stays available via time().
static uint32_t currentLocalEpoch()
{
    time_t nowUtc = time(NULL);
    if (nowUtc == 0)
    {
        return 0;
    }
    // Compute local offset DST-aware without relying on tm_gmtoff:
    // feeding UTC broken-down fields to mktime() (which assumes local
    // input) returns an epoch shifted by the negative local offset.
    struct tm utcTm;
    gmtime_r(&nowUtc, &utcTm);
    utcTm.tm_isdst = -1;
    time_t utcAsLocal = mktime(&utcTm);
    long localOffset = (long)(nowUtc - utcAsLocal);
    return (uint32_t)((long)nowUtc + localOffset);
}

static int currentLocalHour()
{
    time_t nowUtc = time(NULL);
    struct tm localTm;
    localtime_r(&nowUtc, &localTm);
    return localTm.tm_hour;
}

static int currentLocalMinute()
{
    time_t nowUtc = time(NULL);
    struct tm localTm;
    localtime_r(&nowUtc, &localTm);
    return localTm.tm_min;
}

static int currentLocalSecond()
{
    time_t nowUtc = time(NULL);
    struct tm localTm;
    localtime_r(&nowUtc, &localTm);
    return localTm.tm_sec;
}

void loopTime() {
}

// ============================================================================
// Sleep Mode
// ============================================================================

static bool sleepSlotMatches(const SleepSlot& slot, uint8_t hour, uint8_t minute) {
    uint16_t nowMinutes = (uint16_t)hour * 60 + minute;
    uint16_t startMinutes = (uint16_t)slot.startHour * 60 + slot.startMinute;
    uint16_t endMinutes = (uint16_t)slot.endHour * 60 + slot.endMinute;

    if (startMinutes == endMinutes) {
        return false;
    }
    if (endMinutes > startMinutes) {
        return nowMinutes >= startMinutes && nowMinutes < endMinutes;
    }
    return nowMinutes >= startMinutes || nowMinutes < endMinutes;
}

static bool sleepScheduleSaysActive(uint8_t wday, uint8_t hour, uint8_t minute) {
    const SleepDay& day = settings.sleep.days[wday];
    if (day.allDay) return true;

    for (uint8_t slotIndex = 0; slotIndex < day.slotCount; slotIndex++) {
        if (sleepSlotMatches(day.slots[slotIndex], hour, minute)) {
            return true;
        }
    }
    return false;
}

// currentLocalEpoch() returns a local-frame epoch so sleepUntilEpoch
// comparisons stay in the same frame as gmtime() below. Clients that
// pass a UTC epoch must add the local offset before POSTing it.
// SLEEP_REASON_NTP_NOT_SYNCED wins over `enabled` so the diagnostic
// is accurate when the clock is unreliable.
bool sleepIsActive() {
    uint32_t epoch = currentLocalEpoch();

    if (epoch <= NTP_VALID_EPOCH_THRESHOLD) {
        lastSleepReason = SLEEP_REASON_NTP_NOT_SYNCED;
        return false;
    }

    if (!settings.sleep.enabled) {
        lastSleepReason = SLEEP_REASON_NONE;
        return false;
    }

    if (epoch < settings.sleep.sleepUntilEpoch) {
        lastSleepReason = SLEEP_REASON_OVERRIDE;
        return true;
    }

    struct tm* timeinfo = gmtime((time_t*)&epoch);
    uint8_t wday   = (uint8_t)timeinfo->tm_wday;
    uint8_t hour   = (uint8_t)timeinfo->tm_hour;
    uint8_t minute = (uint8_t)timeinfo->tm_min;

    if (sleepScheduleSaysActive(wday, hour, minute)) {
        lastSleepReason = SLEEP_REASON_SCHEDULE;
        return true;
    }

    lastSleepReason = SLEEP_REASON_NONE;
    return false;
}

// ============================================================================
// Display Loop
// ============================================================================

void loopSleepTransition()
{
    static bool wasSleeping = false;
    static uint8_t previousBrightness = DEFAULT_BRIGHTNESS;
    bool isSleeping = sleepIsActive();

